
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Chapter 1 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="Chapter 1. Introduction and Overview.html">
            
                <a href="Chapter 1. Introduction and Overview.html">
            
                    
                    Chapter 1
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >Chapter 1</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="chapter-1-introduction-and-overview">Chapter 1. Introduction and Overview</h2>
<h4 id="11-physics-of-information">1.1 Physics of information</h4>
<p>&#x4FE1;&#x606F;&#xFF0C;&#x662F;&#x7F16;&#x7801;&#x5728;&#x7269;&#x7406;&#x7CFB;&#x7EDF;&#x91CC;&#x7684;&#xFF1B;&#x8BA1;&#x7B97;&#xFF0C;&#x662F;&#x57FA;&#x4E8E;&#x7269;&#x7406;&#x5668;&#x4EF6;&#x5B9E;&#x73B0;&#x7684;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4FE1;&#x606F;&#x8BBA;&#x53EF;&#x4EE5;&#x548C;&#x7269;&#x7406;&#x8FC7;&#x7A0B;&#x8054;&#x7CFB;&#x8D77;&#x6765;&#x3002;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x4EBA;&#x4EEC;&#x5BF9;&#x4F7F;&#x7528;&#x548C;&#x64CD;&#x7EB5;&#x4FE1;&#x606F;&#x7684;&#x7269;&#x7406;&#x7EA6;&#x675F;&#x6709;&#x51E0;&#x4E2A;&#x91CC;&#x7A0B;&#x7891;&#x5F0F;&#x7684;&#x7406;&#x89E3;&#xFF1A;    </p>
<ul>
<li><p><strong>Landauer&#x2019;s principle</strong>. Landauer(1961)&#x6307;&#x51FA;&#x4FE1;&#x606F;&#x64E6;&#x9664;&#x662F;&#x4E2A;&#x8017;&#x6563;&#x8FC7;&#x7A0B;(dissipative process)&#x3002;&#x4ED6;&#x7684;&#x7406;&#x7531;&#x662F;&#x64E6;&#x9664;&#x603B;&#x662F;&#x4F34;&#x968F;&#x76F8;&#x7A7A;&#x95F4;&#x7684;&#x7F29;&#x51CF;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x53EF;&#x9006;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x7528;&#x4E00;&#x4E2A;&#x653E;&#x6709;&#x5355;&#x7C92;&#x5B50;&#x7684;&#x4E2D;&#x95F4;&#x6709;&#x9694;&#x677F;&#x7684;&#x76D2;&#x5B50;&#x6765;&#x5B58;&#x50A8;1bit&#x4FE1;&#x606F;&#x3002;&#x4FE1;&#x606F;&#x64E6;&#x9664;&#x8FC7;&#x7A0B;&#x6307;&#x7684;&#x662F;&#x6211;&#x4EEC;&#x77AC;&#x95F4;&#x62BD;&#x6389;&#x4E2D;&#x95F4;&#x7684;&#x9694;&#x677F;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x6700;&#x53F3;&#x4FA7;&#x5899;&#x58C1;&#x63D2;&#x5165;&#x9694;&#x677F;&#xFF08;&#x4E0D;&#x7BA1;&#x4E4B;&#x524D;&#x7C92;&#x5B50;&#x5728;&#x5DE6;&#x534A;&#x8FB9;&#x8FD8;&#x662F;&#x53F3;&#x534A;&#x8FB9;&#xFF09;&#xFF0C;&#x63A5;&#x7740;&#x7528;&#x9694;&#x677F;&#x628A;&#x7C92;&#x5B50;&#x7F13;&#x6162;&#x63A8;&#x5F80;&#x5DE6;&#x534A;&#x8FB9;&#xFF0C;&#x5B8C;&#x6210;&#x4FE1;&#x606F;&#x64E6;&#x9664;&#x3002;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5355;&#x7C92;&#x5B50;&#x6C14;&#x4F53;&#x51CF;&#x5C0F;&#x4E86;<script type="math/tex; ">\Delta S=k\ln2</script>&#x7684;&#x71B5;&#x3002;&#x8FDB;&#x4E00;&#x6B65;&#x5730;&#xFF0C;&#x5982;&#x679C;&#x8BE5;&#x8FC7;&#x7A0B;&#x662F;&#x5728;&#x6E29;&#x5EA6;<script type="math/tex; ">T</script>&#x4E0B;&#x7684;&#x6052;&#x6E29;&#x8FC7;&#x7A0B;&#xFF0C;&#x90A3;&#x4E48;&#x5916;&#x754C;&#x5BF9;&#x6C14;&#x4F53;&#x505A;&#x529F;<script type="math/tex; ">W=kT\ln2</script>&#xFF0C;&#x8FD9;&#x4E9B;&#x80FD;&#x91CF;&#x8017;&#x6563;&#x5230;&#x70ED;&#x6E90;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x64E6;&#x9664;&#x4FE1;&#x606F;&#x5FC5;&#x7136;&#x9700;&#x8981;&#x6D88;&#x8017;&#x80FD;&#x91CF;&#x3002;</p>
</li>
<li><p><strong>Reversible computation.</strong> &#x903B;&#x8F91;&#x95E8;&#x901A;&#x5E38;&#x662F;&#x4E0D;&#x53EF;&#x9006;&#x7684;&#xFF0C;&#x6BD4;&#x5982;<strong>NAND&#x95E8;</strong>
<script type="math/tex; mode=display">
  (a,b)\rightarrow\neg(a\wedge b)
  </script>
&#x662F;2bit&#x8F93;&#x5165;1bit&#x8F93;&#x51FA;&#xFF0C;&#x901A;&#x8FC7;&#x8F93;&#x51FA;&#x65E0;&#x6CD5;&#x552F;&#x4E00;&#x786E;&#x5B9A;&#x8F93;&#x5165;&#x3002;&#x7531;&#x4E8E;&#x8FD9;&#x4E2A;&#x903B;&#x8F91;&#x95E8;&#x4F1A;&#x64E6;&#x9664;1bit&#x4FE1;&#x606F;&#xFF08;&#x5BF9;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x8F93;&#x5165;<script type="math/tex; ">a,b</script>&#x505A;&#x5E73;&#x5747;&#x610F;&#x4E49;&#x4E0B;&#xFF09;&#xFF0C;&#x4E8E;&#x662F;&#x6839;&#x636E;Landauer&#x2019;s principle&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x8981;&#x8FD0;&#x884C;&#x8FD9;&#x4E2A;&#x903B;&#x8F91;&#x95E8;&#xFF0C;&#x5916;&#x754C;&#x81F3;&#x5C11;&#x505A;&#x529F;<script type="math/tex; ">W=kT\ln2</script>&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x4F9B;&#x7535;&#x7535;&#x91CF;&#x6709;&#x9650;&#xFF0C;&#x8BA1;&#x7B97;&#x65F6;&#x957F;&#x4F1A;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x7406;&#x8BBA;&#x4E0A;&#x754C;&#x3002;&#x5DE6;&#x4E0B;&#x56FE;&#x662F;<strong>NAND&#x95E8;</strong>&#x793A;&#x610F;&#xFF1A;
<img src="figures/NAND.jpg" style="width:200px">             <img src="figures/NAND2.png" style="width:300px"></p>
<p>&#x7136;&#x800C;&#xFF0C;Bennett(1973)&#x53D1;&#x73B0;&#x4EFB;&#x610F;&#x8BA1;&#x7B97;&#x90FD;&#x80FD;&#x7528;&#x53EF;&#x9006;&#x64CD;&#x4F5C;&#x5B9E;&#x73B0;&#xFF0C;&#x56E0;&#x6B64;&#x539F;&#x7406;&#x4E0A;&#x4EFB;&#x610F;&#x8BA1;&#x7B97;&#x90FD;&#x53EF;&#x4EE5;&#x6CA1;&#x6709;&#x8017;&#x6563;&#xFF0C;&#x5373;&#x4E0D;&#x4F1A;&#x6D88;&#x8017;&#x80FD;&#x91CF;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6784;&#x9020;&#x4E0A;&#x8FF0;<strong>NAND&#x95E8;</strong>&#x7684;&#x53EF;&#x9006;&#x7248;&#x672C;&#x2014;&#x2014;<strong>Toffoli&#x95E8;</strong>&#xFF08;&#x53F3;&#x4E0A;&#x56FE;&#xFF09;&#x2014;&#x2014;Toffoli&#x95E8;&#x53EF;&#x4EE5;&#x4FDD;&#x7559;&#x6240;&#x6709;&#x8F93;&#x5165;&#x4FE1;&#x606F;&#xFF1A;
<script type="math/tex; mode=display">
  (a,b,c)\rightarrow(a,b,c\oplus a\wedge b)
  </script>
&#x5B83;&#x8868;&#x793A;&#x4ECE;&#x8F93;&#x5165;<script type="math/tex; ">\{a, b, c\}</script>&#x6620;&#x5C04;&#x5230;&#x8F93;&#x51FA;<script type="math/tex; ">\{a,b,c\ \text{XOR}\ (a\ \text{AND}\ b)\}</script>&#x3002;&#x5B83;&#x662F;&#x53EF;&#x9006;&#x7684;3bit&#x8F93;&#x5165;&#x95E8;&#xFF0C;&#x53EA;&#x6709;&#x524D;&#x4E24;&#x4F4D;&#x90FD;&#x662F;1&#x624D;&#x7FFB;&#x8F6C;&#x7B2C;&#x4E09;&#x4F4D;&#x3002;<strong>Toffoli&#x95E8;</strong>&#x4E2D;<script type="math/tex; ">c=1</script>&#x7684;&#x90A3;&#x4E9B;&#x884C;&#x5BF9;&#x5E94;&#x7684;&#x8F93;&#x51FA;output&#x7684;&#x7B2C;&#x4E09;&#x5217;&#x5C31;&#x5BF9;&#x5E94;<strong>NAND&#x95E8;</strong>&#x3002;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x5C06;&#x4E00;&#x4E2A;&#x4E0D;&#x53EF;&#x9006;&#x8BA1;&#x7B97;NAND&#x95E8;&#x8F6C;&#x6362;&#x6210;&#x53EF;&#x9006;&#x8BA1;&#x7B97;Toffoli&#x95E8;&#xFF0C;&#x4E14;&#x539F;&#x7406;&#x4E0A;&#x80FD;&#x591F;&#x4E0D;&#x4EA7;&#x751F;&#x80FD;&#x91CF;&#x635F;&#x8017;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x4EA7;&#x751F;&#x4E86;&#x5197;&#x4F59;&#x7684;&#x4FE1;&#x606F;&#x201C;&#x5783;&#x573E;&#x201D;&#x3002;&#x6709;&#x4EBA;&#x4F1A;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E2A;&#x6240;&#x8C13;&#x7684;&#x53EF;&#x9006;&#xFF08;&#x65E0;&#x8017;&#x6563;&#xFF09;&#x8BA1;&#x7B97;&#x53EA;&#x4E0D;&#x8FC7;&#x63A8;&#x8FDF;&#x4E86;&#x80FD;&#x91CF;&#x6D88;&#x8017;&#xFF0C;&#x56E0;&#x4E3A;&#x64E6;&#x9664;&#x8FD9;&#x4E9B;&#x5197;&#x4F59;&#x4FE1;&#x606F;&#x9700;&#x8981;&#x989D;&#x5916;&#x80FD;&#x91CF;&#x3002;&#x5BF9;&#x6B64;&#xFF0C;Bennett&#x6307;&#x51FA;&#x4E00;&#x4E2A;&#x53EF;&#x9006;&#x8BA1;&#x7B97;&#x673A;&#x80FD;&#x591F;&#x8FD0;&#x884C;&#x5230;&#x8BA1;&#x7B97;&#x7ED3;&#x675F;&#xFF0C;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x7684;&#x62F7;&#x8D1D;&#xFF08;&#x62F7;&#x8D1D;&#x662F;&#x6052;&#x7B49;&#x6620;&#x5C04;&#xFF0C;&#x56E0;&#x6B64;&#x662F;&#x53EF;&#x9006;&#x8BA1;&#x7B97;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x4E4B;&#x524D;&#x7684;&#x8BA1;&#x7B97;&#x8FC7;&#x7A0B;&#x53CD;&#x5411;&#xFF0C;&#x6062;&#x590D;&#x5230;&#x521D;&#x6001;&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x989D;&#x5916;&#x80FD;&#x91CF;&#x6765;&#x64E6;&#x9664;&#x8FD9;&#x4E9B;&#x5197;&#x4F59;&#x201D;&#x5783;&#x573E;&#x201C;&#x4FE1;&#x606F;&#x4E86;&#x3002;</p>
<p>&#x7ED3;&#x8BBA;&#x5F88;&#x60CA;&#x5947;&#xFF0C;&#x539F;&#x7406;&#x4E0A;&#x505A;&#x4EFB;&#x4F55;&#x8BA1;&#x7B97;&#x90FD;&#x53EF;&#x4EE5;&#x4E0D;&#x6D88;&#x8017;&#x80FD;&#x91CF;&#xFF01;&#x4F46;&#x73B0;&#x5B9E;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x903B;&#x8F91;&#x95E8;&#x5668;&#x4EF6;&#x90FD;&#x4F1A;&#x6D88;&#x8017;&#x8FDC;&#x6BD4;$kT\ln2$&#x5927;&#x5F97;&#x591A;&#x7684;&#x80FD;&#x91CF;&#x3002;&#x56E0;&#x6B64;&#x5DE5;&#x7A0B;&#x4E0A;&#x8BA8;&#x8BBA;Landauer&#x2019;s limit&#x6CA1;&#x592A;&#x5927;&#x4EF7;&#x503C;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5F53;&#x8FD0;&#x7B97;&#x5668;&#x4EF6;&#x8D8A;&#x6765;&#x8D8A;&#x5C0F;&#x65F6;&#xFF0C;&#x8BA1;&#x7B97;&#x6D88;&#x8017;&#x7684;&#x80FD;&#x91CF;&#x5982;&#x679C;&#x6563;&#x53D1;&#x4E0D;&#x51FA;&#x53BB;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x8BA9;&#x5668;&#x4EF6;&#x635F;&#x574F;&#xFF0C;&#x6B64;&#x65F6;&#x7814;&#x7A76;&#x53EF;&#x9006;&#x8BA1;&#x7B97;&#x5C31;&#x53D8;&#x5F97;&#x91CD;&#x8981;&#x4E86;&#x3002;</p>
</li>
<li><p><strong>Maxwell&#x2019;s demon.</strong> &#x4E0A;&#x8FF0;Landauer&#x548C;Bennett&#x7684;&#x6D1E;&#x89C1;&#x5F15;&#x5BFC;&#x4E86;Bennett&#x5728;1982&#x5E74;&#x534F;&#x8C03;&#x4E86;&#x9EA6;&#x514B;&#x65AF;&#x97E6;&#x5996;&#x548C;&#x70ED;&#x529B;&#x5B66;&#x7B2C;&#x4E8C;&#x5B9A;&#x5F8B;&#x7684;&#x77DB;&#x76FE;&#x3002;&#x9EA6;&#x514B;&#x65AF;&#x97E6;&#x60F3;&#x8C61;&#x4E86;&#x4E00;&#x76D2;&#x6C14;&#x4F53;&#xFF0C;&#x4E2D;&#x95F4;&#x7684;&#x9694;&#x677F;&#x628A;&#x5B83;&#x5206;&#x4E3A;A&#xFF0C;B&#x4E24;&#x90E8;&#x5206;&#x7A7A;&#x95F4;&#x3002;&#x9694;&#x677F;&#x4E0A;&#x6709;&#x4E2A;demon&#x64CD;&#x7EB5;&#x7684;&#x5C0F;&#x9600;&#x95E8;&#xFF0C;demon&#x53EF;&#x4EE5;&#x89C2;&#x5BDF;&#x9760;&#x8FD1;&#x9600;&#x95E8;&#x7684;&#x6C14;&#x4F53;&#x5206;&#x5B50;&#xFF0C;&#x4EC5;&#x5141;&#x8BB8;&#x901F;&#x5EA6;&#x5FEB;&#x7684;&#x5206;&#x5B50;&#x4ECE;A&#x7ECF;&#x8FC7;&#x9600;&#x95E8;&#x8FDB;&#x5165;B&#xFF0C;&#x800C;&#x8BA9;&#x901F;&#x5EA6;&#x6162;&#x7684;&#x5206;&#x5B50;&#x4ECE;B&#x8FDB;&#x5165;A&#x3002;&#x4E8E;&#x662F;&#xFF0C;A&#x4E0D;&#x65AD;&#x964D;&#x6E29;&#xFF0C;B&#x4E0D;&#x65AD;&#x5347;&#x6E29;&#xFF0C;&#x4E14;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x80FD;&#x91CF;&#x635F;&#x8017;&#xFF08;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x64CD;&#x7EB5;&#x9600;&#x95E8;&#x4E0D;&#x9700;&#x8981;&#x80FD;&#x91CF;&#xFF0C;&#x6216;&#x8005;&#x5C0F;&#x5230;&#x53EF;&#x5FFD;&#x7565;&#x4E0D;&#x8BA1;&#xFF09;&#x3002;&#x70ED;&#x91CF;&#x5C31;&#x8FD9;&#x6837;&#x4ECE;&#x4F4E;&#x6E29;&#x70ED;&#x6E90;&#x6D41;&#x5411;&#x9AD8;&#x6E29;&#x70ED;&#x6E90;&#x800C;&#x4E0D;&#x4F34;&#x968F;&#x4EFB;&#x4F55;&#x80FD;&#x91CF;&#x635F;&#x8017;&#xFF0C;&#x663E;&#x7136;&#x8FDD;&#x80CC;&#x4E86;&#x70ED;&#x529B;&#x5B66;&#x7B2C;&#x4E8C;&#x5B9A;&#x5F8B;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x8457;&#x540D;&#x7684;Maxwell&#x2019;s paradox&#x3002;</p>
<p>&#x89E3;&#x51B3;Maxwell&#x2019;s paradox&#x7684;&#x5173;&#x952E;&#x662F;&#x8981;&#x7406;&#x89E3;demon &#x5FC5;&#x987B;&#x4E0D;&#x65AD;&#x6536;&#x96C6;&#x548C;&#x5B58;&#x50A8;&#x6C14;&#x4F53;&#x5206;&#x5B50;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x5982;&#x679C;demon&#x7684;&#x8BB0;&#x5FC6;&#x5BB9;&#x91CF;&#x6709;&#x9650;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5C31;&#x4E0D;&#x80FD;&#x65E0;&#x9650;&#x5236;&#x5730;&#x964D;&#x4F4E;&#x6C14;&#x4F53;&#x6E29;&#x5EA6;&#xFF0C;&#x56E0;&#x4E3A;&#x5F53;demon&#x7684;&#x8BB0;&#x5FC6;&#x5BB9;&#x91CF;&#x7528;&#x5B8C;&#x540E;&#xFF0C;&#x5B83;&#x5FC5;&#x987B;&#x6E05;&#x9664;&#x8BB0;&#x5FC6;&#x4FE1;&#x606F;&#x624D;&#x80FD;&#x5B58;&#x50A8;&#x65B0;&#x7684;&#x7C92;&#x5B50;&#x4FE1;&#x606F;&#xFF1B;&#x800C;&#x64E6;&#x9664;&#x8FC7;&#x7A0B;&#x9700;&#x8981;&#x6D88;&#x8017;&#x80FD;&#x91CF;&#xFF0C;&#x8FD9;&#x4E9B;&#x80FD;&#x91CF;&#x62B5;&#x6D88;&#x4E86;&#x4EA7;&#x751F;&#x6E29;&#x5EA6;&#x5DEE;&#xFF08;&#x6216;&#x964D;&#x6E29;&#xFF09;&#x5E26;&#x6765;&#x7684;&#x597D;&#x5904;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x4E2A;&#x89E3;&#x91CA;&#x4F1A;&#x62DB;&#x6765;&#x8D28;&#x7591;&#xFF1A;&#x5728;&#x8BB0;&#x5FC6;&#x5185;&#x5B58;&#x6CA1;&#x7528;&#x5B8C;&#x4E4B;&#x524D;&#xFF0C;&#x6216;demon&#x4E0D;&#x53BB;&#x64E6;&#x9664;&#x8BB0;&#x5FC6;&#xFF0C;&#x6216;&#x8005;&#x6211;&#x4EEC;&#x5728;&#x64E6;&#x9664;&#x524D;&#x7814;&#x7A76;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x70ED;&#x529B;&#x5B66;&#xFF0C;&#x96BE;&#x9053;&#x70ED;&#x4E8C;&#x5B9A;&#x5F8B;&#x5C31;&#x53EF;&#x4EE5;&#x4E0D;&#x6210;&#x7ACB;&#x4E86;&#x5417;&#xFF1F;</p>
<p>&#x4E3A;&#x4E86;&#x56DE;&#x5E94;&#x8FD9;&#x4E2A;&#x8D28;&#x7591;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x8981;&#x5728;&#x8BB0;&#x5FC6;&#x64E6;&#x9664;&#x4E4B;&#x524D;&#xFF0C;&#x5B9A;&#x4E49;&#x4E0E;<strong>&#x5B58;&#x50A8;&#x7684;&#x4FE1;&#x606F;</strong>&#x76F8;&#x5BF9;&#x5E94;&#x7684;<strong>&#x4FE1;&#x606F;&#x71B5;</strong>&#x3002;Leo Szilard(1929)&#x5728;&#x7814;&#x7A76;Maxwell demon&#x4E2D;&#x5B9A;&#x4E49;&#x4E86;1bit&#x4FE1;&#x606F;&#x7684;&#x6982;&#x5FF5;&#xFF08;&quot;bit&quot;&#x7684;&#x540D;&#x79F0;&#x662F;&#x540E;&#x6765;Tukey&#x547D;&#x540D;&#x7684;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x8BA4;&#x4E3A;<strong>&#x83B7;&#x53D6;</strong>1bit&#x4FE1;&#x606F;&#x7B49;&#x4EF7;&#x4E8E;&#x71B5;&#x589E;&#x52A0;<script type="math/tex; ">\Delta S=k\ln2</script>&#x3002;&#x663E;&#x7136;Szilard&#x5E76;&#x6CA1;&#x6709;&#x5B8C;&#x5168;&#x6293;&#x4F4F;Landauer&#x2019;s principle&#x7684;&#x6838;&#x5FC3;&#x8981;&#x70B9;&#xFF0C;&#x56E0;&#x4E3A;&#x540E;&#x8005;&#x8BF4;&#x7684;&#x662F;&#x4FE1;&#x606F;<strong>&#x64E6;&#x9664;</strong>&#x5FC5;&#x987B;&#x8981;&#x4ED8;&#x51FA;&#x4EE3;&#x4EF7;&#xFF08;&#x71B5;or&#x80FD;&#x91CF;&#xFF09;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4FE1;&#x606F;<strong>&#x83B7;&#x53D6;</strong>&#x3002;&#x4F46;&#x4E0D;&#x7BA1;&#x600E;&#x6837;&#xFF0C;Szilard&#x4ECD;&#x65E7;&#x662F;&#x7814;&#x7A76;&#x4FE1;&#x606F;&#x7684;&#x7269;&#x7406;&#x539F;&#x7406;&#x7684;&#x4E00;&#x4F4D;&#x5148;&#x9A71;&#x3002;</p>
</li>
</ul>
<p>&#x4EE5;&#x4E0A;&#x4F8B;&#x5B50;&#x8868;&#x660E;&#xFF0C;&#x7269;&#x7406;&#x5B66;&#x4E0E;&#x4FE1;&#x606F;&#x8BBA;&#x7684;&#x5B66;&#x79D1;&#x4EA4;&#x53C9;&#x50AC;&#x751F;&#x51FA;&#x4E86;&#x8BB8;&#x591A;&#x5F88;&#x6709;&#x8DA3;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x5438;&#x5F15;&#x4E86;&#x4E00;&#x5927;&#x6279;&#x7269;&#x7406;&#x5B66;&#x5BB6;&#x548C;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x5BB6;&#x3002;</p>
<h4 id="12-quantum-information">1.2 Quantum information</h4>
<p>&#x6211;&#x4EEC;&#x7684;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x5C31;&#x662F;&#x4E00;&#x53E5;&#x8BDD;&#xFF1A;
<script type="math/tex; mode=display">
\textbf{“Information is physical."}
</script>
&#x4ECE;&#x6839;&#x672C;&#x4E0A;&#x8BF4;&#xFF0C;&#x4E16;&#x754C;&#x662F;&#x7531;<strong>&#x91CF;&#x5B50;&#x7269;&#x7406;</strong>&#x652F;&#x914D;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x91CF;&#x5B50;&#x7269;&#x7406;&#x662F;&#x5982;&#x4F55;&#x63ED;&#x793A;&#x4FE1;&#x606F;&#x7684;&#x672C;&#x8D28;&#x7684;&#x5462;&#xFF1F;</p>
<p>&#x5728;&#x91CF;&#x5B50;&#x7406;&#x8BBA;&#x65E9;&#x671F;&#xFF0C;&#x4EBA;&#x4EEC;&#x5C31;&#x5DF2;&#x7ECF;&#x8BA4;&#x8BC6;&#x5230;&#x4FE1;&#x606F;&#x7684;&#x7ECF;&#x5178;&#x8BA4;&#x77E5;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x4E86;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x76D6;&#x9769;&#x8BA1;&#x6570;&#x5668;&#xFF08;&#x91CF;&#x5B50;&#x539F;&#x7406;&#x652F;&#x914D;&#xFF09;&#x8BB0;&#x5F55;&#x7684;&#x51FB;&#x53D1;(clicks )&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x771F;&#x6B63;&#x968F;&#x673A;&#xFF08;truly random&#xFF09;&#x7684;&#x6CCA;&#x677E;&#x8FC7;&#x7A0B;&#xFF1B;&#x7136;&#x800C;&#x7ECF;&#x5178;&#x51B3;&#x5B9A;&#x6027;(deterministic)&#x529B;&#x5B66;&#x5E76;&#x6CA1;&#x6709;&#x771F;&#x6B63;&#x968F;&#x673A;&#x6027;&#x4E4B;&#x8BF4;&#xFF08;&#x5373;&#x4FBF;&#x590D;&#x6742;&#x4E00;&#x70B9;&#x7684;<strong>&#x6DF7;&#x6C8C;</strong>&#x7CFB;&#x7EDF;&#x4E5F;&#x53EA;&#x662F;&#x5728;&#x6548;&#x679C;&#x4E0A;&#x548C;<strong>&#x968F;&#x673A;</strong>&#x76F8;&#x5DEE;&#x65E0;&#x51E0;&#xFF0C;&#x4E24;&#x8005;&#x672C;&#x8D28;&#x5E76;&#x4E0D;&#x540C;&#xFF09;&#x3002;</p>
<p>&#x6B64;&#x5916;&#xFF0C;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x539F;&#x7406;&#x8981;&#x6C42;&#xFF0C;&#x4E24;&#x4E2A;&#x975E;&#x5BF9;&#x6613;&#x7269;&#x7406;&#x91CF;&#x65E0;&#x6CD5;&#x540C;&#x65F6;&#x5177;&#x6709;&#x786E;&#x5B9A;&#x503C;&#x3002;&#x56E0;&#x6B64;&#x6D4B;&#x91CF;&#x7269;&#x7406;&#x91CF;A&#x52BF;&#x5FC5;&#x4F1A;&#x5F71;&#x54CD;&#x7D27;&#x63A5;&#x7740;&#x7684;&#x5BF9;B&#xFF08;&#x4E0E;A&#x4E0D;&#x5BF9;&#x6613;&#xFF09;&#x7684;&#x6D4B;&#x91CF;&#x7ED3;&#x679C;&#x3002;&#x6240;&#x4EE5;&#x83B7;&#x53D6;&#x7CFB;&#x7EDF;&#x4FE1;&#x606F;&#x7684;&#x64CD;&#x4F5C;&#x4F1A;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x5E72;&#x6270;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x6B64;&#x9650;&#x5236;&#x5728;&#x7ECF;&#x5178;&#x7269;&#x7406;&#x91CC;&#x5E76;&#x65E0;&#x5BF9;&#x5E94;&#x3002;&#x201C;&#x83B7;&#x5F97;&#x4FE1;&#x606F;&#x201D;&#x4E0E;&#x201C;&#x4EA7;&#x751F;&#x5E72;&#x6270;&#x201D;&#x7684;&#x53D6;&#x820D;&#x4E0E;quantum randomness&#x6709;&#x5173;&#x3002;&#x6B63;&#x662F;&#x56E0;&#x4E3A;&#x6D4B;&#x91CF;&#x7ED3;&#x679C;&#x6709;&#x4E2A;&#x968F;&#x673A;&#x91CF;&#xFF08;&#x7EDD;&#x5BF9;&#x76F8;&#x4F4D;&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x4ECE;&#x6D4B;&#x91CF;&#x7ED3;&#x679C;&#x63A8;&#x65AD;&#x521D;&#x59CB;&#x6001;&#x7684;&#x6240;&#x6709;&#x4FE1;&#x606F;&#xFF0C;&#x5373;&#x521D;&#x59CB;&#x7684;&#x76F8;&#x4F4D;&#xFF0C;&#x800C;&#x8FD9;&#x6B63;&#x662F;&#x6D4B;&#x91CF;&#x6240;&#x60F3;&#x5F97;&#x5230;&#x7684;&#x3002;</p>
<p>&#x201C;&#x83B7;&#x53D6;&#x4FE1;&#x606F;&#x4EA7;&#x751F;&#x5E72;&#x6270;&#x201D;&#x4E5F;&#x548C;&#x91CF;&#x5B50;&#x4E0E;&#x7ECF;&#x5178;&#x4FE1;&#x606F;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x533A;&#x522B;&#x6709;&#x5173;&#xFF0C;&#x5373;&#x91CF;&#x5B50;&#x4E0D;&#x53EF;&#x514B;&#x9686;&#x539F;&#x7406;(the no-cloning principle: quantum information cannot be copied with perfect fidelity) (Wootters, Zurek, Dieks in 1982)&#x3002;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x7684;&#x786E;&#x53EF;&#x4EE5;&#x5B8C;&#x7F8E;&#x514B;&#x9686;&#x4E00;&#x4E2A;&#x91CF;&#x5B50;&#x6001;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x80FD;&#x6D4B;&#x91CF;&#x8FD9;&#x4E2A;&#x590D;&#x5236;&#x6001;&#x7684;&#x7269;&#x7406;&#x91CF;&#xFF0C;&#x800C;&#x4E0D;&#x7528;&#x5E72;&#x6270;&#x539F;&#x6765;&#x7684;&#x6001;&#xFF0C;&#x4E0D;&#x53EF;&#x514B;&#x9686;&#x539F;&#x7406;&#x5426;&#x5B9A;&#x4E86;&#x8FD9;&#x79CD;&#x53EF;&#x80FD;&#x6027;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x7ECF;&#x5178;&#x4FE1;&#x606F;&#x5C31;&#x53EF;&#x4EE5;&#x5B8C;&#x7F8E;&#x590D;&#x5236;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x6211;&#x4EEC;&#x80FD;&#x4F7F;&#x7528;U&#x76D8;&#x62F7;&#x8D1D;&#x7684;&#x539F;&#x56E0;&#x3002;</p>
<p>&#x4E0A;&#x8FF0;&#x91CF;&#x5B50;&#x4FE1;&#x606F;&#x7684;&#x6027;&#x8D28;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x4F46;&#x662F;&#x91CF;&#x5B50;&#x4FE1;&#x606F;&#x4E0E;&#x7ECF;&#x5178;&#x4FE1;&#x606F;&#x771F;&#x6B63;&#x672C;&#x8D28;&#x7684;&#x533A;&#x522B;&#x8FD8;&#x662F;John Bell(1964)&#x6307;&#x51FA;&#x7684;&#xFF0C;&#x91CF;&#x5B50;&#x529B;&#x5B66;&#x7684;&#x9884;&#x6D4B;&#x5E76;&#x4E0D;&#x53D7;&#x5C40;&#x57DF;&#x9690;&#x53D8;&#x91CF;&#x7406;&#x8BBA;&#xFF08;local hidden variable theory&#xFF09;&#x652F;&#x914D;&#x3002;Bell&#x63D0;&#x51FA;&#x91CF;&#x5B50;&#x4FE1;&#x606F;&#x88AB;&#x7F16;&#x7801;&#x5728;&#x7269;&#x7406;&#x4F53;&#x7CFB;&#x4E0D;&#x540C;&#x90E8;&#x5206;&#x7684;&#x975E;&#x5C40;&#x57DF;&#x5173;&#x8054;&#xFF08;nonlocal correlations&#xFF09;&#x4E2D;&#xFF0C;&#x8FD9;&#x79CD;&#x5173;&#x8054;&#x5728;&#x7ECF;&#x5178;&#x7269;&#x7406;&#x91CC;&#x627E;&#x4E0D;&#x5230;&#x5BF9;&#x5E94;&#x3002;</p>
<p>&#x91CF;&#x5B50;&#x4FE1;&#x606F;&#x53D1;&#x8F6B;&#x4E8E;1980&#x5E74;&#x4EE3;&#xFF0C;1990&#x5E74;&#x4EE3;&#x5168;&#x9762;&#x5F00;&#x82B1;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x5728;&#x540E;&#x9762;&#x8BA8;&#x8BBA;&#xFF1A;&#x91CF;&#x5B50;&#x4FE1;&#x606F;&#x538B;&#x7F29;&#xFF0C;&#x7F16;&#x7801;&#x5728;&#x91CF;&#x5B50;&#x4F53;&#x7CFB;&#x7684;&#x7ECF;&#x5178;&#x4FE1;&#x606F;&#x7684;&#x4E0A;&#x4E0B;&#x754C;&#xFF0C;&#x901A;&#x8FC7;&#x542B;&#x566A;&#x58F0;&#x7684;&#x91CF;&#x5B50;&#x4FE1;&#x9053;&#x4F20;&#x8F93;&#x7684;&#x91CF;&#x5B50;&#x4FE1;&#x606F;&#x7684;&#x4E0A;&#x4E0B;&#x754C;&#x3002;</p>
<h4 id="13-efficient-quantum-algorithms">1.3 Efficient quantum algorithms</h4>
<p>&#x65E2;&#x7136;&#x91CF;&#x5B50;&#x4FE1;&#x606F;&#x6709;&#x8FD9;&#x4E48;&#x591A;&#x5947;&#x7279;&#x6027;&#x8D28;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x671F;&#x5F85;&#x91CF;&#x5B50;&#x7406;&#x8BBA;&#x53EF;&#x4EE5;&#x66F4;&#x65B0;&#x6211;&#x4EEC;&#x5BF9;&#x8BA1;&#x7B97;&#x7684;&#x8BA4;&#x77E5;&#x3002;Peter Shor (an AT&amp;T computer scientist and a former Caltech undergraduate)&#x5728;1994&#x5E74;&#x7ED9;&#x4E86;&#x4E00;&#x4E2A;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x9AD8;&#x6548;&#x5730;&#x5B8C;&#x6210;&#x8D28;&#x56E0;&#x6570;&#x5206;&#x89E3;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x582A;&#x6BD4;&#x6674;&#x5929;&#x9739;&#x96F3;&#x3002;&#x8D28;&#x56E0;&#x6570;&#x5206;&#x89E3;&#x662F;&#x5F88;&#x96BE;&#x5BF9;&#x4ED8;&#x7684;(intractable)&#x8BA1;&#x7B97;&#x95EE;&#x9898;&#xFF1A;&#x7B54;&#x6848;&#x4E00;&#x65E6;&#x627E;&#x5230;&#x5F88;&#x5BB9;&#x6613;&#x9A8C;&#x8BC1;&#xFF0C;&#x53EA;&#x8981;&#x76F8;&#x4E58;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#xFF1B;&#x4F46;&#x95EE;&#x9898;&#x662F;&#x7B54;&#x6848;&#x5F88;&#x96BE;&#x627E;&#x5230;&#x3002;&#x5982;&#x679C;$p$&#x548C;$q$&#x662F;&#x5F88;&#x5927;&#x7684;&#x8D28;&#x6570;&#xFF0C;&#x90A3;&#x4E48;&#x4ED6;&#x4EEC;&#x7684;&#x4E58;&#x79EF;$n=pq$&#x5F88;&#x5BB9;&#x6613;&#x8BA1;&#x7B97;&#xFF0C;&#x57FA;&#x672C;&#x7684;&#x4F4D;&#x64CD;&#x4F5C;(bit operations)&#x6570;&#x5927;&#x7EA6;&#x662F;$\log_2p\cdot\log_2q$&#xFF0C;&#x4F46;&#x7ED9;&#x5B9A;$n$&#x5C31;&#x5F88;&#x96BE;&#x627E;&#x5230;$p$&#x548C;$q$&#x4E86;&#x3002;</p>
<p><strong>&#x7ECF;&#x5178;&#x8BA1;&#x7B97;&#x673A;&#x8FDB;&#x884C;&#x8D28;&#x56E0;&#x6570;&#x5206;&#x89E3;&#x516C;&#x8BA4;&#x9700;&#x8981;$\ln(n)$&#x7684;&#x8D85;&#x8D8A;&#x591A;&#x9879;&#x5F0F;(superpolynomial)&#x65F6;&#x95F4;</strong>&#xFF08;&#x867D;&#x7136;&#x8FD8;&#x6CA1;&#x88AB;&#x4E25;&#x683C;&#x8BC1;&#x660E;&#xFF09;&#xFF0C;&#x5373;&#x5F53;$n$&#x589E;&#x957F;&#x65F6;&#xFF0C;&#x6700;&#x5DEE;&#x60C5;&#x51B5;&#x9700;&#x8981;&#x7684;&#x65F6;&#x95F4;&#x6BD4;$\ln(n)$&#x7684;&#x4EFB;&#x4F55;&#x6B21;&#x5E42;&#x90FD;&#x5927;&#x3002;&#x6700;&#x597D;&#x7684;&#x7B97;&#x6CD5;(the &#x201C;number field sieve&#x201D;)&#x9700;&#x8981;&#x8017;&#x65F6;&#x7EA6;$\exp[(64/9)^{1/3}(\ln n)^{1/3}(\ln \ln n)^{2/3}]$&#x3002;&#x76EE;&#x524D;&#x6700;&#x5927;&#x7684;&#x8FD0;&#x7B97;&#x91CF;&#x662F;&#x51E0;&#x767E;&#x4E2A;&#x5DE5;&#x4F5C;&#x7AD9;&#x7B97;&#x4E00;&#x4E2A;&#x6708;&#xFF0C;&#x5C06;130&#x4F4D;&#x6570;&#x5206;&#x89E3;&#x6210;65&#x4F4D;&#x6570;&#x3002;&#x7531;&#x6B64;&#x63A8;&#x7B97;&#xFF0C;&#x5206;&#x89E3;400&#x4F4D;&#x6570;&#x9700;&#x8981;$10^{10}$&#x5E74;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x5B87;&#x5B99;&#x5E74;&#x9F84;&#xFF01;&#x8D28;&#x56E0;&#x6570;&#x5206;&#x89E3;&#x7684;&#x96BE;&#x5EA6;&#x5C31;&#x662F;&#x73B0;&#x4EE3;&#x516C;&#x94A5;&#x52A0;&#x5BC6;&#x6280;&#x672F;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x6BD4;&#x5982;RSA&#x52A0;&#x5BC6;&#x6280;&#x672F;&#x3002;</p>
<p>&#x7136;&#x800C;Shor&#x53D1;&#x73B0;&#xFF0C;<strong>&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x53EF;&#x4EE5;&#x5728;&#x591A;&#x9879;&#x5F0F;&#x65F6;&#x95F4;$O[(\ln n)^3]$&#x5185;&#x5B8C;&#x6210;&#x8D28;&#x56E0;&#x6570;&#x5206;&#x89E3;&#x8BA1;&#x7B97;</strong>&#x3002;&#x5728;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x9762;&#x524D;&#xFF0C;&#x73B0;&#x6709;&#x7684;RSA&#x6280;&#x672F;&#x5C06;&#x65E0;&#x6CD5;&#x4FDD;&#x5BC6;&#x3002;</p>
<h4 id="14-quantum-complexity">1.4 Quantum complexity</h4>
<p>&#x5728;Shor&#x4E4B;&#x524D;&#xFF0C;&#x5DF2;&#x7ECF;&#x6709;&#x4EBA;&#x5BF9;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x8DC3;&#x8DC3;&#x6B32;&#x8BD5;&#x3002;&#x201C;&#x91CF;&#x5B50;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x6267;&#x884C;&#x8BA1;&#x7B97;&#x201D;&#x8FD9;&#x4EF6;&#x4E8B;&#x5206;&#x522B;&#x7531;Paul Benioff&#x548C;Richard Feynman&#x5728;1982&#x5E74;&#x72EC;&#x7ACB;&#x63D0;&#x51FA;&#x3002;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x968F;&#x7740;&#x5FAE;&#x7535;&#x8DEF;&#x7684;&#x53D8;&#x5C0F;&#x800C;&#x81EA;&#x7136;&#x4EA7;&#x751F;&#xFF0C;&#x56E0;&#x4E3A;&#x5230;&#x5F88;&#x5C0F;&#x5C3A;&#x5EA6;&#x91CF;&#x5B50;&#x6548;&#x5E94;&#x5FC5;&#x7136;&#x663E;&#x8457;&#xFF0C;Benioff&#x5C31;&#x57FA;&#x4E8E;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x3002;&#x4F46;&#x662F;Feynman&#x7684;&#x51FA;&#x53D1;&#x70B9;&#x5F88;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x8981;&#x4E86;&#x89E3;Feynman&#x7684;&#x6D1E;&#x89C1;&#xFF0C;&#x5148;&#x5F97;&#x8BF4;&#x8BF4;&#x91CF;&#x5B50;&#x4FE1;&#x606F;&#x548C;&#x8BA1;&#x7B97;&#x7684;&#x6570;&#x5B66;&#x63CF;&#x8FF0;&#x3002;</p>
<p>&#x4F20;&#x7EDF;&#x6BD4;&#x7279;(bit)&#x7684;&#x6700;&#x5C0F;&#x5355;&#x5143;&#x7528;0&#x548C;1&#x4E24;&#x79CD;&#x72B6;&#x6001;&#x8868;&#x793A;&#xFF0C;&#x91CF;&#x5B50;&#x6BD4;&#x7279;(qubit)&#x7528;&#x5F52;&#x4E00;&#x6B63;&#x4EA4;&#x57FA;$|0\rangle$&#x548C;$|1\rangle$&#x5F20;&#x6210;&#x7684;&#x4E8C;&#x7EF4;&#x590D;&#x7A7A;&#x95F4;&#x8868;&#x793A;&#x3002;&#x4E00;&#x4E2A;&#x5F52;&#x4E00;&#x5316;&#x7684;&#x91CF;&#x5B50;&#x6BD4;&#x7279;&#x8868;&#x793A;&#x4E3A;$|\psi\rangle=a|0\rangle    +b|1\rangle$&#xFF0C;&#x5176;&#x4E2D;$|a|^2+|b|^2=1$&#x3002;&#x5176;&#x4E2D;$a,b\in\bold{C}$&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6D4B;&#x91CF;$|\psi\rangle$&#x5230;&#x4E24;&#x4E2A;&#x57FA;&#x7684;&#x6295;&#x5F71;&#x5927;&#x5C0F;&#xFF0C;&#x6D4B;&#x91CF;&#x7ED3;&#x679C;&#x662F;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#xFF1A;&#x6295;&#x5230;$|0\rangle$&#x7684;&#x6982;&#x7387;&#x662F;$|a|^2$&#xFF0C;$|1\rangle$&#x7684;&#x6982;&#x7387;&#x662F;$|b|^2$&#x3002;</p>
<p>&#x5177;&#x6709;N&#x4E2A;qubits&#x7684;&#x91CF;&#x5B50;&#x6001;&#x53EF;&#x4EE5;&#x7528;$2^N$&#x7EF4;&#x5E0C;&#x5C14;&#x4F2F;&#x7279;&#x7A7A;&#x95F4;&#x7684;&#x5411;&#x91CF;&#x8868;&#x793A;&#xFF0C;&#x6BD4;&#x5982;$|01110010 &#xB7; &#xB7; &#xB7;1001\rangle$&#x3002;&#x6BCF;&#x4E2A;&#x6B63;&#x4EA4;&#x5F52;&#x4E00;&#x57FA;&#x88AB;&#x7F16;&#x53F7;&#x4E3A;$|x\rangle$&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x8FD9;&#x4E2A;&#x7A7A;&#x95F4;&#x91CC;&#x4E00;&#x822C;&#x7684;&#x6001;$\sum_{x=0}^{2^N-1}a_x|x\rangle$&#xFF0C;&#x5176;&#x4E2D;$\sum_x|a_x|^2=1$&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5728;&#x6BCF;&#x4E00;&#x4F4D;&#x4E0A;&#x90FD;&#x7528;${|0\rangle,|1\rangle}$&#x6B63;&#x4EA4;&#x57FA;&#x6765;&#x6D4B;&#x91CF;N&#x4E2A;qubits&#xFF0C;&#x90A3;&#x4E48;&#x5F97;&#x5230;$|x\rangle$&#x6001;&#x7684;&#x6982;&#x7387;&#x4E3A;$|a_x|^2$&#x3002;</p>
<p>&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x8BA8;&#x8BBA;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x51C6;&#x5907;N&#x4E2A;qubits&#x7684;&#x6807;&#x51C6;&#x521D;&#x6001;$|0\rangle|0\rangle &#xB7; &#xB7; &#xB7; |0\rangle$&#xFF0C;&#x6216;&#x8868;&#x793A;&#x6210;$|x=0\rangle$&#x3002;&#x7136;&#x540E;&#x5BF9;&#x8FD9;&#x4E2A;&#x521D;&#x6001;&#x505A;&#x5E7A;&#x6B63;&#x53D8;&#x6362;$U$&#xFF08;$U$&#x53EF;&#x5206;&#x89E3;&#x6210;&#x6807;&#x51C6;&#x5316;&#x91CF;&#x5B50;&#x903B;&#x8F91;&#x95E8;&#x7684;&#x4E58;&#x79EF;&#xFF0C;&#x6BCF;&#x4E2A;&#x6807;&#x51C6;&#x91CF;&#x5B50;&#x95E8;&#x6BCF;&#x6B21;&#x53EA;&#x5BF9;&#x51E0;&#x4E2A;qubits&#x505A;&#x5E7A;&#x6B63;&#x53D8;&#x6362;&#xFF09;&#x3002;&#x53D8;&#x6362;$U$&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x6D4B;&#x91CF;&#x6240;&#x6709;qubits&#x5728;&#x57FA;&#x5411;&#x91CF;${|0\rangle,|1\rangle}$&#x4E0A;&#x7684;&#x6295;&#x5F71;&#xFF0C;&#x8FD9;&#x4E2A;&#x6D4B;&#x91CF;&#x503C;&#x5C31;&#x662F;&#x8BA1;&#x7B97;&#x7684;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#xFF0C;&#x6240;&#x4EE5;&#x6700;&#x7EC8;&#x7684;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x662F;&#x53EF;&#x4EE5;&#x6253;&#x5370;&#x5728;&#x7EB8;&#x4E0A;&#x7684;&#x7ECF;&#x5178;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6CE8;&#x610F;&#x5230;&#xFF0C;<strong>&#x91CF;&#x5B50;&#x7B97;&#x6CD5;&#x662F;&#x4E00;&#x79CD;&#x6982;&#x7387;&#x7B97;&#x6CD5;</strong>(probabilistic algorithm)&#xFF0C;&#x5373;&#x7531;&#x4E8E;&#x91CF;&#x5B50;&#x6D4B;&#x91CF;&#x8FC7;&#x7A0B;&#x7684;&#x968F;&#x673A;&#x6027;&#xFF0C;&#x540C;&#x6837;&#x7684;&#x7A0B;&#x5E8F;&#x53EF;&#x80FD;&#x5F97;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x6700;&#x7EC8;&#x5F97;&#x5230;&#x7684;&#x662F;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x8F93;&#x51FA;&#x7684;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x51FD;&#x6570;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;Shor&#x7684;&#x56E0;&#x6570;&#x5206;&#x89E3;&#x7B97;&#x6CD5;&#x4E5F;&#x53EA;&#x80FD;&#x4FDD;&#x8BC1;&#x5927;&#x6982;&#x7387;&#x80FD;&#x5F97;&#x5230;&#x6B63;&#x786E;&#x7684;&#x8D28;&#x56E0;&#x6570;&#xFF1B;&#x5F53;&#x7136;&#x8FD9;&#x4E5F;&#x53EF;&#x63A5;&#x53D7;&#xFF0C;&#x56E0;&#x4E3A;&#x5F88;&#x5BB9;&#x6613;&#x9A8C;&#x8BC1;&#x7ED3;&#x679C;&#x662F;&#x5426;&#x6B63;&#x786E;&#x3002;</p>
<p>&#x9700;&#x8981;&#x8BF4;&#x660E;&#x7684;&#x662F;&#xFF0C;<strong>&#x5C3D;&#x7BA1;&#x539F;&#x7406;&#x4E0D;&#x540C;&#xFF0C;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x53EF;&#x4EE5;&#x505A;&#x7684;&#xFF0C;&#x7ECF;&#x5178;&#x8BA1;&#x7B97;&#x673A;&#x4E5F;&#x90FD;&#x80FD;&#x505A;</strong>&#x3002;&#x7ECF;&#x5178;&#x8BA1;&#x7B97;&#x673A;&#x53EF;&#x4EE5;&#x50A8;&#x5B58;&#x548C;&#x65CB;&#x8F6C;&#x5411;&#x91CF;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x6A21;&#x62DF;&#x91CF;&#x5B50;&#x6D4B;&#x91CF;&#x8FC7;&#x7A0B;&#xFF08;&#x6295;&#x5F71;&#x5230;&#x6B63;&#x4EA4;&#x57FA;&#x5411;&#x91CF;&#xFF09;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x7ECF;&#x5178;&#x8BA1;&#x7B97;&#x673A;&#x53EF;&#x4EE5;&#x4EFB;&#x610F;&#x7CBE;&#x5EA6;&#x6A21;&#x62DF;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x3002;&#x7528;&#x54EA;&#x79CD;&#x8BA1;&#x7B97;&#x673A;&#x4E0D;&#x662F;&#x91CD;&#x70B9;&#xFF0C;&#x56E0;&#x4E3A;&#x4EC0;&#x4E48;&#x662F;&#x201C;&#x53EF;&#x8BA1;&#x7B97;&#x7684;&#x201D;&#x5BF9;&#x4E24;&#x8005;&#x6765;&#x8BF4;&#x76F8;&#x540C;&#x3002;</p>
<p><strong>&#x4F46;&#x7528;&#x7ECF;&#x5178;&#x8BA1;&#x7B97;&#x673A;&#x6A21;&#x62DF;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x4E5F;&#x6709;&#x5C40;&#x9650;</strong>&#xFF0C;&#x9700;&#x8981;&#x8003;&#x8651;&#x5230;&#x8FD9;&#x79CD;&#x6A21;&#x62DF;&#x7684;&#x65F6;&#x957F;&#x3002;&#x6BD4;&#x5982;&#x6A21;&#x62DF;$N=100$qubits&#x7684;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x8868;&#x793A;&#x4EFB;&#x610F;&#x4E00;&#x4E2A;&#x4E00;&#x822C;&#x7684;&#x72B6;&#x6001;$|\psi\rangle$&#x5C31;&#x9700;&#x8981;&#x7528;&#x5230;$2^{100}\approx10^{30}$&#x4E2A;&#x590D;&#x6570;&#xFF0C;&#x8FD9;&#x4E2A;&#x5B58;&#x50A8;&#x80FD;&#x529B;&#x8FDC;&#x8D85;&#x4EFB;&#x4F55;&#x7ECF;&#x5178;&#x8BA1;&#x7B97;&#x673A;&#x4E86;&#xFF0C;&#x800C;&#x4E14;&#x5BF9;$10^{30}$&#x7EF4;&#x5411;&#x91CF;&#x8FDB;&#x884C;&#x65CB;&#x8F6C;&#x64CD;&#x4F5C;&#x4E5F;&#x8FDC;&#x8D85;&#x4EFB;&#x4F55;&#x7ECF;&#x5178;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x3002;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x7528;$N=100$&#x7ECF;&#x5178;&#x6BD4;&#x7279;&#x8868;&#x793A;&#x7684;&#x4EFB;&#x610F;&#x4E00;&#x4E2A;&#x4E00;&#x822C;&#x72B6;&#x6001;&#xFF0C;&#x5C3D;&#x7BA1;&#x5B83;&#x4E5F;&#x53EF;&#x4EE5;&#x8868;&#x793A;$2^{100}$&#x4E2A;&#x53EF;&#x80FD;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x4F46;&#x53EA;&#x9700;&#x8981;&#x7528;&#x957F;&#x5EA6;&#x4E3A;$N$&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x5B57;&#x7B26;&#x4E32;&#x8868;&#x793A;&#x5373;&#x53EF;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x7EB5;&#x4F7F;&#x7ECF;&#x5178;&#x8BA1;&#x7B97;&#x673A;&#x53EF;&#x4EE5;&#x6A21;&#x62DF;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x5F53;$N$&#x53D8;&#x5927;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6A21;&#x62DF;&#x4E5F;&#x4F1A;&#x65E0;&#x80FD;&#x4E3A;&#x529B;&#xFF0C;&#x56E0;&#x4E3A;&#x5E0C;&#x5C14;&#x4F2F;&#x7279;&#x7A7A;&#x95F4;&#x662F;&#x5728;&#x592A;&#x5927;&#x4E86;&#xFF01;Feynman&#x6B63;&#x662F;&#x57FA;&#x4E8E;&#x6B64;&#x624D;&#x8003;&#x8651;&#x5230;&#xFF0C;<strong>&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x6216;&#x8BB8;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x7ECF;&#x5178;&#x8BA1;&#x7B97;&#x673A;&#x4E0D;&#x53EF;&#x80FD;&#x5B8C;&#x6210;&#x7684;&#x4EFB;&#x52A1;</strong>&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x8FD9;&#x4E2A;&#x7ECF;&#x5178;&#x8BA1;&#x7B97;&#x673A;&#x80FD;&#x529B;&#x7684;&#x56F0;&#x5883;&#x5417;&#xFF1F;&#x53CD;&#x8FC7;&#x6765;&#x601D;&#x8003;&#x4E00;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x8981;&#x6C42;&#x6A21;&#x62DF;&#x80FD;&#x7ED9;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x6982;&#x7387;&#x5206;&#x5E03;&#xFF0C;&#x4F46;&#x662F;&#x4E2D;&#x95F4;&#x8FC7;&#x7A0B;&#x4E0D;&#x5FC5;&#x5B8C;&#x6574;&#x6A21;&#x62DF;N-qubit&#x7684;&#x91CF;&#x5B50;&#x6001;&#x6F14;&#x5316;&#x8FC7;&#x7A0B;&#x3002;&#x56E0;&#x6B64;&#xFF0C;<strong>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8BBE;&#x8BA1;&#x4E00;&#x79CD;&#x7ECF;&#x5178;&#x7B97;&#x6CD5;&#x7684;&#x6982;&#x7387;&#x5316;&#x7248;&#x672C;(probabilistic classical algorithm)</strong>&#xFF1A;&#x8F93;&#x5165;&#x5E76;&#x4E0D;&#x552F;&#x4E00;&#x51B3;&#x5B9A;&#x8F93;&#x51FA;&#xFF0C;&#x800C;&#x662F;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x670D;&#x4ECE;&#x4E0E;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x76F8;&#x540C;&#x7684;&#x6982;&#x7387;&#x5206;&#x5E03;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x201C;&#x5C40;&#x57DF;&#x7684;&#x6A21;&#x62DF;&#x201D;&#xFF08;local simulation&#xFF09;&#xFF1A;&#x6BCF;&#x4E00;&#x6B65;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;qubit&#x6709;&#x786E;&#x5B9A;&#x503C;&#xFF0C;&#x4F46;&#x5904;&#x7406;&#x8FD9;&#x4E2A;qubit&#x7684;&#x91CF;&#x5B50;&#x903B;&#x8F91;&#x95E8;&#x4F9D;&#x636E;&#xFF08;&#x4F2A;&#xFF09;&#x968F;&#x673A;&#x6570;&#x9009;&#x5B9A;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x64CD;&#x4F5C;&#x65B9;&#x5F0F;&#x4E4B;&#x4E00;&#x3002;&#x8FD9;&#x79CD;&#x6A21;&#x62DF;&#x65B9;&#x5F0F;&#x5927;&#x5927;&#x7B80;&#x5316;&#x4E86;&#x5B8C;&#x5168;&#x8DDF;&#x8E2A;&#x91CF;&#x5B50;&#x6001;&#x6F14;&#x5316;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x4F46;<strong>Bell&#x4E0D;&#x7B49;&#x5F0F;&#x7528;&#x6570;&#x5B66;&#x5B9A;&#x7406;&#x4E0D;&#x53EF;&#x8FA9;&#x9A73;&#x5730;&#x6307;&#x51FA;&#xFF0C;&#x8FD9;&#x79CD;&#x6A21;&#x62DF;&#x4E0D;&#x53EF;&#x80FD;&#x5B9E;&#x73B0;</strong>&#xFF1A;&#x4E0D;&#x5B58;&#x5728;&#x5C40;&#x57DF;&#x7684;&#x6982;&#x7387;&#x5316;&#x7B97;&#x6CD5;&#x53EF;&#x4EE5;&#x590D;&#x73B0;&#x91CF;&#x5B50;&#x529B;&#x5B66;&#x7684;&#x7ED3;&#x679C;&#xFF01;&#x3010;&#x6211;&#x6CE8;&#xFF1A;&#x91CF;&#x5B50;&#x5173;&#x8054;&#x662F;&#x975E;&#x5C40;&#x57DF;&#x7684;&#xFF0C;&#x5373;&#x9690;&#x53D8;&#x91CF;&#x7406;&#x8BBA;&#x662F;&#x4E0D;&#x6B63;&#x786E;&#x7684;&#x3011;&#x5728;&#x8FD9;&#x4E2A;&#x610F;&#x4E49;&#x4E0A;&#xFF0C;&#x7528;&#x7ECF;&#x5178;&#x8BA1;&#x7B97;&#x673A;&#x6A21;&#x62DF;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x662F;&#x5F88;&#x56F0;&#x96BE;&#x7684;&#x3002;</p>
<h4 id="15-quantum-parallelism">1.5 Quantum parallelism</h4>
<p>Feynman&#x7684;&#x60F3;&#x6CD5;&#x5728;1985&#x5E74;&#x88AB;David Deutsch&#x89E3;&#x91CA;&#x5730;&#x66F4;&#x5177;&#x4F53;&#xFF0C;<strong>Deutsch&#x6307;&#x51FA;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x6F5C;&#x80FD;&#x5728;&#x4E8E;&#x91CF;&#x5B50;&#x5E76;&#x884C;&#x6027;</strong>(quantum parallelism)&#x3002;&#x8003;&#x8651;&#x4E00;&#x4E2A;&#x9ED1;&#x5323;&#x5B50;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x4E00;&#x4E2A;&#x6BD4;&#x7279;$x$&#x6620;&#x5C04;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x6BD4;&#x7279;$f(x)$&#x4E0A;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x4E0D;&#x77E5;&#x9053;&#x5185;&#x90E8;&#x53D1;&#x751F;&#x4E86;&#x4EC0;&#x4E48;&#x3002;&#x4E00;&#x5171;&#x6709;&#x56DB;&#x79CD;&#x53EF;&#x80FD;&#x7684;&#x51FD;&#x6570;&#x6620;&#x5C04;&#x5173;&#x7CFB;$f(x)$&#xFF0C;&#x8981;&#x5206;&#x522B;&#x8BA1;&#x7B97;$f(0)$&#x548C;$f(1)$&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x9700;&#x8981;&#x6D88;&#x8017;&#x4E24;&#x500D;&#x65F6;&#x95F4;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x9000;&#x4E00;&#x6B65;&#xFF0C;&#x53EA;&#x662F;&#x60F3;&#x9A8C;&#x8BC1;$f(0)=f(1)$&#x8FD8;&#x662F;$f(0)\neq f(1)$&#xFF0C;&#x4E5F;&#x8FD8;&#x662F;&#x9700;&#x8981;&#x505A;&#x4E24;&#x6B21;&#x8BA1;&#x7B97;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x770B;&#x770B;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x80FD;&#x4E0D;&#x80FD;&#x53EA;&#x7528;&#x4E00;&#x6B21;&#x8BA1;&#x7B97;&#xFF08;&#x6D88;&#x8017;&#x4E00;&#x500D;&#x65F6;&#x95F4;&#xFF09;&#x5C31;&#x80FD;&#x5B8C;&#x6210;&#x4EFB;&#x52A1;&#x3002;&#x5C3D;&#x7BA1;&#x6620;&#x5C04;$f(x)$&#x53EF;&#x80FD;&#x662F;&#x4E0D;&#x53EF;&#x9006;&#x7684;&#xFF0C;&#x4F46;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x8FC7;&#x7A0B;&#x662F;&#x5E7A;&#x6B63;&#x7684;&#x4E14;&#x4E00;&#x5B9A;&#x662F;&#x53EF;&#x9006;&#x7684;&#x3002;&#x8003;&#x8651;&#x5E7A;&#x6B63;&#x53D8;&#x6362;
<script type="math/tex; mode=display">
U_f : |x\rangle|y\rangle\rightarrow|x\rangle|y\oplus f(x)\rangle .
</script>
&#x6B64;&#x64CD;&#x4F5C;&#x8868;&#x793A;&#xFF0C;&#x82E5;$f(x)=1$&#x5C31;&#x7FFB;&#x8F6C;$y$&#xFF0C;&#x82E5;$f(x)=0$&#x5219;&#x4E0D;&#x505A;&#x4EFB;&#x4F55;&#x64CD;&#x4F5C;&#x3002;Deutsch&#x95EE;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x80FD;&#x4E0D;&#x80FD;&#x53EA;&#x6267;&#x884C;&#x4E00;&#x6B21;&#x64CD;&#x4F5C;&#x5C31;&#x9A8C;&#x8BC1;$f(0)$&#x4E0E;$f(1)$&#x76F8;&#x540C;&#x8FD8;&#x662F;&#x4E0D;&#x540C;&#xFF1F;</p>
<p>&#x5BF9;&#x4E8E;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x9009;&#x53D6;$|y\rangle$&#x4E3A;&#x53E0;&#x52A0;&#x6001;&#xFF0C;&#x4E8E;&#x662F;&#x6620;&#x5C04;
<script type="math/tex; mode=display">
U_f: |x\rangle\frac{1}{\sqrt{2}}(|0\rangle-|1\rangle)\rightarrow |x\rangle\frac{1}{\sqrt{2}}(|f(x)\rangle-|1\oplus f(x)\rangle)=|x\rangle(-1)^{f(x)}\frac{1}{\sqrt{2}}(|0\rangle-|1\rangle)
</script>
&#x6B64;&#x65F6;&#x5C06;$f(x)$&#x5206;&#x79BB;&#x5230;&#x4E86;&#x524D;&#x9762;&#x7CFB;&#x6570;&#x4E2D;&#xFF08;&#x4E0E;$x$&#x6709;&#x5173;&#x7684;&#x76F8;&#x4F4D;&#x9879;&#xFF09;&#x3002;&#x6709;&#x4E86;&#x8FD9;&#x4E2A;&#x7ED3;&#x679C;&#xFF0C;&#x518D;&#x5C06;$|x\rangle$&#x4E5F;&#x6539;&#x6210;&#x53E6;&#x4E00;&#x4E2A;&#x53E0;&#x52A0;&#x6001;&#xFF1A;
<script type="math/tex; mode=display">
U_f:\frac{1}{\sqrt{2}}(|0\rangle+|1\rangle)\frac{1}{\sqrt{2}}(|0\rangle-|1\rangle)\rightarrow\frac{1}{\sqrt{2}}[(-1)^{f(0)}|0\rangle+(-1)^{f(1)}|1\rangle]\frac{1}{\sqrt{2}}(|0\rangle-|1\rangle)
</script>
&#x6700;&#x540E;&#xFF0C;&#x5C06;&#x7B2C;&#x4E00;&#x4E2A;&#x6BD4;&#x7279;&#x6295;&#x5F71;&#x5230;&#x53E6;&#x4E00;&#x7EC4;&#x57FA;&#x5411;&#x91CF;$|\pm\rangle=\frac{1}{\sqrt{2}}(|0\rangle\pm|1\rangle)$&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x5F97;&#x5230;$|+\rangle$&#x5219;&#x6709;$f(0)=f(1)$&#xFF0C;&#x82E5;&#x5F97;&#x5230;$|-\rangle$&#x5219;&#x6709;$f(0)\neq f(1)$&#x3002;&#x6210;&#x529F;&#x4E86;&#xFF01;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x53EA;&#x9700;&#x8981;&#x4E00;&#x6B21;&#x8BA1;&#x7B97;&#x5C31;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x4EFB;&#x52A1;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7ECF;&#x5178;&#x8BA1;&#x7B97;&#x673A;&#x6240;&#x5FC5;&#x987B;&#x7684;&#x4E24;&#x6B21;&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x64CD;&#x4F5C;&#x7684;&#x4E0D;&#x662F;&#x5355;&#x4E2A;&#x6001;&#x800C;&#x662F;&#x53E0;&#x52A0;&#x6001;&#xFF0C;&#x53EF;&#x4EE5;&#x4E00;&#x6B21;&#x83B7;&#x5F97;&#x4E0D;&#x540C;&#x53EF;&#x80FD;&#x6001;&#x7684;&#x5168;&#x5C40;&#x4FE1;&#x606F;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x610F;&#x4E49;&#x4E0A;&#x6211;&#x4EEC;&#x79F0;&#x5B83;&#x5177;&#x6709;<strong>&#x91CF;&#x5B50;&#x5E76;&#x884C;&#x6027;</strong>(quantum parallelism)&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x53EF;&#x4EE5;<strong>&#x63A8;&#x5E7F;&#x5230;&#x4F5C;&#x7528;&#x5728;N-qubit&#x4E0A;&#x7684;&#x51FD;&#x6570;</strong>$f(x)$&#xFF0C;&#x6B64;&#x51FD;&#x6570;&#x5177;&#x6709;$2^N$&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x5982;$f(|0100...\rangle)$&#xFF0C;&#x56E0;&#x6B64;&#x8981;&#x5F97;&#x5230;&#x51FD;&#x6570;$f(x)$&#x6620;&#x5C04;&#x8868;&#x9700;&#x8981;&#x6267;&#x884C;$2^N$&#x6B21;&#x8BA1;&#x7B97;&#x3002;&#x4F46;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x53EA;&#x9700;&#x8981;&#x6267;&#x884C;&#x5E7A;&#x6B63;&#x53D8;&#x6362;&#xFF1A;
<script type="math/tex; mode=display">
U_f:|x\rangle|0\rangle\rightarrow|x\rangle|f(x)\rangle
</script>
&#x7136;&#x540E;&#x5BF9;&#x5B58;&#x50A8;&#x5728;&#x8F93;&#x5165;&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#x7684;&#x521D;&#x6001;
<script type="math/tex; mode=display">
|\psi\rangle\equiv\left[\frac{1}{\sqrt{2}}(|0\rangle+|1\rangle)\right]^{N}=\frac{1}{2^{N / 2}} \sum_{x=0}^{2^{N}-1}|x\rangle
</script>
&#x53EA;&#x6267;&#x884C;&#x4E00;&#x6B21;&#x4E0A;&#x8FF0;&#x53D8;&#x6362;&#x5F97;&#x5230;
<script type="math/tex; mode=display">
\frac{1}{2^{N/2}}\sum_{x=0}^{2^N-1}|x\rangle|f(x)\rangle
</script>
&#x51FD;&#x6570;$f$&#x7684;&#x5168;&#x5C40;&#x4FE1;&#x606F;&#x90FD;&#x5305;&#x542B;&#x5728;&#x4E86;&#x8FD9;&#x4E2A;&#x6001;&#x4E2D;&#xFF08;&#x8F93;&#x5165;&#x5BC4;&#x5B58;&#x5668;&#x548C;&#x8F93;&#x51FA;&#x5BC4;&#x5B58;&#x5668;&#x53D1;&#x751F;&#x4E86;&#x7EA0;&#x7F20;&#xFF09;&#xFF0C;&#x53EA;&#x8981;&#x6211;&#x4EEC;&#x60F3;&#x4E2A;&#x529E;&#x6CD5;&#x63D0;&#x53D6;&#x51FA;&#x6765;&#x5373;&#x53EF;&#x3002;&#x51FD;&#x6570;&#x518D;&#x590D;&#x6742;&#x90FD;&#x53EA;&#x9700;&#x8981;&#x8BA1;&#x7B97;&#x4E00;&#x6B21;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x91CF;&#x5B50;&#x5E76;&#x884C;&#x6027;&#x7684;&#x5A01;&#x529B;&#x3002;&#x8FD9;&#x79CD;&#x5E76;&#x884C;&#x6027;&#x4E5F;&#x662F;Shor&#x8BBE;&#x8BA1;&#x56E0;&#x6570;&#x5206;&#x89E3;&#x7B97;&#x6CD5;&#x7684;&#x51FA;&#x53D1;&#x70B9;&#x3002;</p>
<p>&#x91CF;&#x5B50;&#x4FE1;&#x606F;&#x662F;&#x7F16;&#x7801;&#x5728;&#x975E;&#x5C40;&#x57DF;&#x5173;&#x8054;&#xFF08;&#x7EA0;&#x7F20;&#xFF09;&#x4E2D;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x4E0A;&#x8FF0;$f(x)$&#x7684;&#x4FE1;&#x606F;&#x5305;&#x542B;&#x5728;&#x4E86;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x8F93;&#x5165;&#x5BC4;&#x5B58;&#x5668;&#x548C;&#x8F93;&#x51FA;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x7EA0;&#x7F20;&#x4E2D;&#xFF0C;&#x5982;&#x4F55;&#x63D0;&#x53D6;&#x8FD9;&#x4E2A;&#x975E;&#x5C40;&#x57DF;&#x4FE1;&#x606F;&#x5E76;&#x4E0D;&#x5BB9;&#x6613;&#x3002;&#x56E0;&#x4E3A;&#x4E00;&#x65E6;&#x6D4B;&#x91CF;&#x8F93;&#x5165;&#x5BC4;&#x5B58;&#x5668;&#xFF0C;&#x5B83;&#x5C31;&#x4F1A;&#x968F;&#x673A;&#x584C;&#x7F29;&#x5230;&#x67D0;&#x4E00;&#x4E2A;&#x672C;&#x5F81;&#x6001;$|x_0\rangle$&#xFF0C;&#x76F8;&#x5E94;&#x5730;&#xFF0C;&#x7EA0;&#x7F20;&#x6001;&#x88AB;&#x7834;&#x574F;&#xFF0C;&#x584C;&#x7F29;&#x4E3A;$|x_0\rangle|f(x_0)\rangle$&#xFF0C;&#x56E0;&#x6B64;&#x6D4B;&#x91CF;&#x8F93;&#x51FA;&#x5BC4;&#x5B58;&#x5668;&#x53EA;&#x80FD;&#x5F97;&#x5230;$f(x_0)$&#xFF0C;&#x8FDB;&#x4E00;&#x6B65;&#x6D4B;&#x91CF;&#x5C31;&#x65E0;&#x6CD5;&#x518D;&#x5F97;&#x5230;&#x5176;&#x4ED6;&#x53EF;&#x80FD;&#x8F93;&#x51FA;&#x503C;&#x4E86;&#xFF0C;&#x6B64;&#x65F6;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x5E76;&#x4E0D;&#x6BD4;&#x7ECF;&#x5178;&#x7684;&#x5F3A;&#x5927;&#x3002;</p>
<p>Deutsch&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#xFF0C;&#x5982;&#x4F55;&#x5DE7;&#x5999;&#x5229;&#x7528;&#x7F16;&#x7801;&#x5728;&#x91CF;&#x5B50;&#x975E;&#x5C40;&#x57DF;&#x5173;&#x8054;&#x4E2D;&#x7684;&#x6709;&#x6548;&#x4FE1;&#x606F;&#x662F;&#x8BBE;&#x8BA1;&#x91CF;&#x5B50;&#x7B97;&#x6CD5;&#x7684;&#x5173;&#x952E;&#x3002;</p>
<h4 id="16-a-new-classification-of-complexity">1.6 A new classification of complexity</h4>
<p>&#x533A;&#x5206;&#x7B80;&#x5355;&#x548C;&#x56F0;&#x96BE;&#x7684;&#x8BA1;&#x7B97;&#x95EE;&#x9898;&#x7684;&#x6807;&#x51C6;&#x5E94;&#x8BE5;&#x662F;&#x666E;&#x9002;&#x7684;&#xFF0C;&#x5B83;&#x4E0D;&#x4EE5;&#x4F7F;&#x7528;&#x9AD8;&#x6027;&#x80FD;&#x8FD8;&#x662F;&#x8001;&#x7834;&#x65E7;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x800C;&#x6539;&#x53D8;&#x3002;&#x4E00;&#x822C;&#x5206;&#x4E3A;&#x591A;&#x9879;&#x5F0F;&#x65F6;&#x95F4;(polynomial time)&#x548C;&#x6307;&#x6570;&#x65F6;&#x95F4;(exponential time)&#x3002;</p>
<p>&#x4EFB;&#x610F;&#x7B97;&#x6CD5;A&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x590D;&#x6742;&#x5EA6;$T_A(N)$&#xFF0C;$N$&#x662F;&#x7528;bit&#x8868;&#x793A;&#x7684;&#x8F93;&#x5165;&#x957F;&#x5EA6;&#x3002;$T_A(N)$&#x8868;&#x793A;&#x5BF9;&#x4EFB;&#x610F;N-bit&#x8F93;&#x5165;&#x6240;&#x9700;&#x6700;&#x957F;&#x65F6;&#x95F4;&#x6B65;&#xFF0C;&#x5373;&#x6700;&#x574F;&#x60C5;&#x51B5;&#x4E0B;&#x6700;&#x957F;&#x65F6;&#x95F4;&#x3002;<strong>&#x591A;&#x9879;&#x5F0F;&#x65F6;&#x95F4;</strong>&#x6307;&#x7684;&#x662F;$T_A(N)\leq\text{Poly}(N)$&#xFF0C;&#x5373;&#x4E0D;&#x4F1A;&#x957F;&#x4E8E;$N$&#x7684;&#x67D0;&#x4E2A;&#x5E42;&#x6B21;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4E0D;&#x662F;&#x591A;&#x9879;&#x5F0F;&#x65F6;&#x95F4;&#xFF0C;&#x7EDF;&#x79F0;&#x4E3A;<strong>&#x6307;&#x6570;&#x65F6;&#x95F4;</strong>&#x3002;&#x5F53;&#x7136;&#x4E5F;&#x6709;&#x8D85;&#x591A;&#x9879;&#x5F0F;(superpolynomial)&#x65F6;&#x95F4;$O(N^{\log N})$&#xFF0C;&#x8FDC;&#x6BD4;&#x6307;&#x6570;&#x65F6;&#x95F4;&#x5C0F;&#xFF0C;&#x4F46;&#x4E5F;&#x88AB;&#x8BEF;&#x79F0;&#x4E3A;&#x6307;&#x6570;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x5BF9;&#x7B97;&#x6CD5;&#x505A;&#x533A;&#x5206;&#x7684;&#x597D;&#x5904;&#x662F;&#xFF0C;&#x4E0D;&#x7BA1;&#x5728;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#x662F;&#x591A;&#x9879;&#x5F0F;&#x65F6;&#x95F4;&#xFF0C;&#x90A3;&#x4E48;&#x7528;&#x6211;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x8FD0;&#x884C;&#x540C;&#x6837;&#x7684;&#x7B97;&#x6CD5;&#x4E5F;&#x9700;&#x8981;&#x591A;&#x9879;&#x5F0F;&#x65F6;&#x95F4;&#xFF1B;&#x5373;&#x4F7F;&#x8FD0;&#x7B97;&#x4E0D;&#x4E86;&#xFF0C;&#x6211;&#x4E5F;&#x53EF;&#x4EE5;&#x4EFF;&#x771F;&#x4F60;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x6BCF;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;&#x5F97;&#x5230;&#x591A;&#x9879;&#x5F0F;&#x65F6;&#x95F4;&#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x79CD;&#x4EFF;&#x771F;&#x4E5F;&#x53EA;&#x9700;&#x8981;&#x591A;&#x9879;&#x5F0F;&#x65F6;&#x95F4;&#xFF0C;&#x7EFC;&#x5408;&#x6548;&#x679C;&#x8FD8;&#x662F;&#x591A;&#x9879;&#x5F0F;&#x65F6;&#x95F4;&#xFF08;&#x5F53;&#x7136;&#x9700;&#x8981;&#x6392;&#x9664;&#x6389;&#x90A3;&#x4E9B;&#x201C;&#x4E0D;&#x73B0;&#x5B9E;&#x201D;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x6BD4;&#x5982;&#x6709;&#x65E0;&#x7A77;&#x591A;&#x4E2A;&#x7ED3;&#x70B9;&#x7684;&#x5E76;&#x884C;&#x8BA1;&#x7B97;&#x673A;&#xFF09;&#x3002;</p>
<p>&#x5982;&#x679C;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x4E5F;&#x80FD;&#x88AB;&#x8FD9;&#x6837;&#x4EFF;&#x771F;&#xFF0C;&#x50CF;1.4&#x8282;&#x4E2D;&#x6240;&#x8BF4;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x90A3;&#x4E48;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x5C31;&#x53EA;&#x662F;&#x6280;&#x672F;&#x4E0A;&#x7684;&#x8FDB;&#x6B65;&#x4E86;&#xFF0C;&#x5374;&#x65E0;&#x6CD5;&#x8BA9;&#x7ECF;&#x5178;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x591A;&#x9879;&#x5F0F;&#x65F6;&#x95F4;&#x8FD9;&#x4E2A;&#x6570;&#x5B66;&#x4E8B;&#x5B9E;&#x6539;&#x53D8;&#xFF08;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x4E5F;&#x53EA;&#x662F;&#x591A;&#x9879;&#x5F0F;&#x65F6;&#x95F4;&#xFF09;&#x3002;&#x7136;&#x800C;Shor&#x7B97;&#x6CD5;&#x63ED;&#x793A;&#x4E86;&#xFF08;&#x5E76;&#x6CA1;&#x6709;&#x88AB;&#x8BC1;&#x660E;&#xFF09;&#xFF0C;&#x4E0D;&#x53EF;&#x80FD;&#x7528;&#x591A;&#x9879;&#x5F0F;&#x65F6;&#x95F4;&#x6765;&#x4EFF;&#x771F;&#x4E00;&#x53F0;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#xFF01;&#x8FD9;&#x5C31;&#x6539;&#x53D8;&#x4E86;&#x4E00;&#x5207;&#xFF01;&#x6570;&#x5B66;&#x610F;&#x4E49;&#x4E0A;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x5BF9;&#x4E8E;&#x7ECF;&#x5178;&#x7684;&#x901A;&#x7528;&#x8BA1;&#x7B97;&#x673A;&#xFF08;&#x56FE;&#x7075;&#x673A;&#xFF09;&#x8FD8;&#x662F;&#x6210;&#x7ACB;&#x7684;&#xFF0C;&#x4F46;&#x5BF9;&#x4E8E;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x6216;&#x8BB8;&#x4E0D;&#x9002;&#x7528;&#x3002;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x91CF;&#x5B50;&#x7248;&#x672C;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x5B9A;&#x4E49;&#x3002;</p>
<h4 id="17-what-about-errors">1.7 What about errors?</h4>
<p>&#x91CF;&#x5B50;&#x4FE1;&#x606F;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x90E8;&#x5206;&#x662F;<strong>&#x91CF;&#x5B50;&#x7EA0;&#x9519;</strong>&#xFF08;quantum error correction&#xFF09;&#xFF0C;&#x6709;&#x4E86;&#x8FD9;&#x4E2A;&#x80FD;&#x529B;&#xFF0C;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x7684;&#x5B9E;&#x7528;&#x5316;&#x624D;&#x80FD;&#x770B;&#x5230;&#x66D9;&#x5149;&#x3002;&#x6B63;&#x5982;&#x4E4B;&#x524D;&#x6240;&#x8BF4;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x91CF;&#x5B50;&#x4FE1;&#x606F;&#x50A8;&#x5B58;&#x5728;&#x7CFB;&#x7EDF;&#x5404;&#x90E8;&#x5206;&#x7684;&#x975E;&#x5C40;&#x57DF;&#x5173;&#x8054;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x6B21;&#x53EA;&#x770B;&#x67D0;&#x4E2A;&#x5B50;&#x7CFB;&#x7EDF;&#xFF0C;&#x53EA;&#x80FD;&#x83B7;&#x5F97;&#x5FAE;&#x4E4E;&#x5176;&#x5FAE;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x79CD;&#x5173;&#x8054;&#x53C8;&#x5F88;&#x8106;&#x5F31;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x88AB;&#x7834;&#x574F;&#x3002;&#x5927;&#x7CFB;&#x7EDF;&#x5F88;&#x96BE;&#x4E0E;&#x73AF;&#x5883;&#x5B8C;&#x5168;&#x9694;&#x7EDD;&#xFF0C;&#x4E00;&#x65E6;&#x7CFB;&#x7EDF;&#x548C;&#x73AF;&#x5883;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x4EA7;&#x751F;&#x4E86;&#x5173;&#x8054;&#xFF0C;&#x7CFB;&#x7EDF;&#x5185;&#x90E8;&#x7684;&#x91CF;&#x5B50;&#x4FE1;&#x606F;&#x5C31;&#x8F6C;&#x79FB;&#x5230;&#x4E86;&#x7CFB;&#x7EDF;&#x548C;&#x73AF;&#x5883;&#x7684;&#x5173;&#x8054;&#x4E2D;&#x53BB;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x4EC5;&#x89C2;&#x5BDF;&#x7CFB;&#x7EDF;&#x672C;&#x8EAB;&#x5F97;&#x5230;&#x6709;&#x7528;&#x4FE1;&#x606F;&#x4E86;&#x3002;&#x5373;&#x4F7F;&#x7CFB;&#x7EDF;&#x548C;&#x73AF;&#x5883;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x5F88;&#x5F31;&#xFF0C;&#x5BF9;&#x6BD4;&#x8F83;&#x5927;&#x7684;&#x7CFB;&#x7EDF;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E2A;&#x6548;&#x5E94;&#x53D1;&#x751F;&#x5730;&#x5F88;&#x5FEB;&#x3002;</p>
<p>Erwin Schrodinger&#x66FE;&#x7ECF;&#x63F6;&#x63C4;&#x91CF;&#x5B50;&#x529B;&#x5B66;&#x4E3B;&#x6D41;&#x89E3;&#x91CA;&#x7684;&#x62E5;&#x62A4;&#x8005;&#xFF0C;&#x8BF4;&#x53E0;&#x52A0;&#x6001;&#x4F1A;&#x5BFC;&#x81F4;&#x4E00;&#x53EA;&#x53C8;&#x6B7B;&#x53C8;&#x6D3B;&#x7684;&#x732B;&#x5B58;&#x5728;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x90A3;&#x53EA;&#x8457;&#x540D;&#x7684;&#x201C;&#x859B;&#x5B9A;&#x8C14;&#x7684;&#x732B;&#x201D;&#xFF1A;<script type="math/tex; ">|cat\rangle=\frac{1}{\sqrt{2}}(|dead\rangle+|alive\rangle).</script>Schrodinger&#x8BA4;&#x4E3A;&#x8FD9;&#x4E2A;&#x6001;&#x662F;&#x91CF;&#x5B50;&#x529B;&#x5B66;&#x767D;&#x7389;&#x4E4B;&#x5FAE;&#x7455;&#xFF0C;&#x56E0;&#x4E3A;&#x73B0;&#x5B9E;&#x4E2D;&#x4ECE;&#x6CA1;&#x4EBA;&#x770B;&#x5230;&#x8FC7;&#x4E00;&#x53EA;&#x5904;&#x4E8E;&#x53E0;&#x52A0;&#x6001;&#x7684;&#x732B;&#x3002;</p>
<p>&#x91CF;&#x5B50;&#x529B;&#x5B66;&#x53D1;&#x5C55;&#x81F3;&#x4ECA;&#xFF0C;&#x6216;&#x8BB8;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x56DE;&#x7B54;Schrodinger&#x7684;&#x7591;&#x60D1;&#x3002;&#x859B;&#x5B9A;&#x8C14;&#x732B;&#x6001;&#x7406;&#x8BBA;&#x4E0A;&#x53EF;&#x4EE5;&#x5B58;&#x5728;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x6781;&#x7AEF;&#x4E0D;&#x7A33;&#x5B9A;&#x3002;&#x56E0;&#x4E3A;&#x732B;&#x4E0D;&#x4F1A;&#x8131;&#x79BB;&#x5468;&#x56F4;&#x73AF;&#x5883;&#x800C;&#x5B58;&#x5728;&#xFF08;&#x7A7A;&#x6C14;&#xFF0C;&#x5730;&#x9762;&#xFF0C;&#x9633;&#x5149;&#x7167;&#x5C04;&#x8FC7;&#x6765;&#x7684;&#x5149;&#x5B50;&#x7B49;&#xFF09;&#x3002;&#x5047;&#x8BBE;&#x6709;&#x4EBA;&#x5236;&#x5907;&#x4E86;&#x4E00;&#x4E2A;&#x859B;&#x5B9A;&#x8C14;&#x732B;&#x6001;$|cat\rangle$&#xFF0C;&#x5904;&#x4E8E;&#x53E0;&#x52A0;&#x6001;&#x4E2D;&#x7684;&#x91CF;&#x5B50;&#x4FE1;&#x606F;&#x4F1A;&#x77AC;&#x95F4;&#x8F6C;&#x79FB;&#x5230;&#x732B;&#x548C;&#x73AF;&#x5883;&#x7684;&#x7EA0;&#x7F20;&#x4E2D;&#x6D88;&#x6563;&#x800C;&#x53BB;&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#xFF0C;<strong>&#x73AF;&#x5883;&#x548C;&#x732B;&#x7684;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#xFF0C;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x73AF;&#x5883;&#x4E0D;&#x65AD;&#x5BF9;&#x732B;&#x8FDB;&#x884C;&#x6D4B;&#x91CF;</strong>&#xFF0C;&#x4F7F;&#x5F97;&#x732B;&#x5FC5;&#x987B;&#x6295;&#x5F71;&#x5230;$|dead\rangle$&#x6216;$|alive\rangle$&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x672C;&#x5F81;&#x6001;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x53EB;&#x4F5C;&#x201C;<strong>&#x91CF;&#x5B50;&#x9000;&#x76F8;&#x5E72;</strong>&#x201D;&#x3002;&#x3010;&#x6211;&#x6CE8;&#xFF1A;&#x81F3;&#x4E8E;&#x4E3A;&#x4EC0;&#x4E48;&#x4E00;&#x5B9A;&#x8981;&#x9009;&#x8FD9;&#x7EC4;&#x57FA;&#x800C;&#x4E0D;&#x662F;&#x53E6;&#x5916;&#x4E24;&#x4E2A;&#x53E0;&#x52A0;&#x6001;&#x4F5C;&#x4E3A;&#x57FA;&#xFF0C;&#x6211;&#x731C;&#x60F3;&#x662F;&#x8FD9;&#x4E24;&#x4E2A;&#x201C;&#x80FD;&#x91CF;&#x201D;&#x672C;&#x5F81;&#x6001;&#x7684;&#x672C;&#x5F81;&#x503C;&#x76F8;&#x5DEE;&#x5F88;&#x5927;&#x9020;&#x6210;&#x7684;&#xFF0C;&#x5373;&#x6B7B;&#x732B;&#x548C;&#x6D3B;&#x732B;&#x7684;&#x201C;&#x80FD;&#x91CF;&#x201D;&#x76F8;&#x5DEE;&#x5F88;&#x5927;&#x3002;so?&#x3011;</p>
<p>&#x540C;&#x6837;&#x9053;&#x7406;&#xFF0C;&#x8981;&#x6267;&#x884C;&#x590D;&#x6742;&#x7684;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#xFF0C;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x8981;&#x642D;&#x5EFA;&#x6BD4;&#x8F83;&#x5927;&#x7684;&#x91CF;&#x5B50;&#x7CFB;&#x7EDF;&#xFF08;&#x4E5F;&#x8BB8;&#x6CA1;&#x6709;&#x732B;&#x90A3;&#x4E48;&#x5927;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x5927;&#x7684;&#x91CF;&#x5B50;&#x7CFB;&#x7EDF;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x8981;&#x4E0E;&#x73AF;&#x5883;&#x63A5;&#x89E6;&#x5BFC;&#x81F4;&#x9000;&#x76F8;&#x5E72;&#x6548;&#x5E94;&#xFF0C;&#x4F7F;&#x5F97;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x5931;&#x6548;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;<strong>&#x9000;&#x76F8;&#x5E72;&#x4F1A;&#x5BF9;&#x91CF;&#x5B50;&#x4FE1;&#x606F;&#x5F15;&#x5165;&#x8BEF;&#x5DEE;</strong>&#xFF0C;&#x8981;&#x8BA9;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x7EA0;&#x6B63;&#x8BEF;&#x5DEE;&#x3002;</p>
<p>&#x6B64;&#x5916;&#xFF0C;&#x5373;&#x4F7F;&#x6211;&#x4EEC;&#x80FD;&#x628A;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x4E0E;&#x73AF;&#x5883;&#x5B8C;&#x5168;&#x9694;&#x7EDD;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;<strong>&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x5B83;&#x7684;&#x65E0;&#x8BEF;&#x5DEE;&#x8FD0;&#x884C;</strong>&#x3002;&#x7406;&#x60F3;&#x60C5;&#x51B5;&#x662F;&#x5BF9;&#x51E0;&#x4E2A;qubits&#x505A;&#x5E7A;&#x6B63;&#x53D8;&#x6362;$U$&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#x53D8;&#x6362;&#x4F1A;&#x6709;&#x8BEF;&#x5DEE;$U=U_0(1+O(\varepsilon))$&#xFF0C;&#x5373;$U$&#x4F1A;&#x548C;$U_0$&#x76F8;&#x5DEE;$O(\varepsilon)$&#xFF0C;&#x5728;$O(1/\varepsilon)$&#x6B21;&#x903B;&#x8F91;&#x95E8;&#x53D8;&#x6362;&#x4E4B;&#x540E;&#xFF0C;&#x8BEF;&#x5DEE;&#x5C06;&#x65E0;&#x6CD5;&#x5FFD;&#x7565;&#x3002;&#x540C;&#x6837;&#x5730;&#xFF0C;&#x7ECF;&#x5178;&#x8BA1;&#x7B97;&#x673A;&#x4E5F;&#x6709;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x7ECF;&#x5178;&#x8BA1;&#x7B97;&#x673A;&#x53EF;&#x4EE5;&#x5C06;&#x6BCF;&#x6B21;&#x903B;&#x8F91;&#x95E8;&#x64CD;&#x4F5C;&#x4EA7;&#x751F;&#x7684;&#x8BEF;&#x5DEE;&#x4EE5;&#x70ED;&#x91CF;&#x5F62;&#x5F0F;&#x8017;&#x6563;&#x5230;&#x73AF;&#x5883;&#x4E2D;&#xFF08;&#x60F3;&#x8C61;&#x53CC;&#x52BF;&#x9631;&#x4E2D;&#x6EDA;&#x52A8;&#x7684;&#x5C0F;&#x7403;&#xFF0C;&#x8BA1;&#x7B97;&#x5F15;&#x5165;&#x7684;&#x6270;&#x52A8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x964D;&#x6E29;&#x8017;&#x6563;&#x5230;&#x73AF;&#x5883;&#x4E2D;&#xFF09;&#xFF0C;&#x4ECE;&#x800C;&#x907F;&#x514D;&#x5F71;&#x54CD;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x3002;&#x7136;&#x800C;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x6070;&#x6070;&#x76F8;&#x53CD;&#xFF0C;&#x4E0E;&#x73AF;&#x5883;&#x7684;&#x63A5;&#x89E6;&#x53CD;&#x800C;&#x4F1A;&#x7834;&#x574F;&#x91CF;&#x5B50;&#x4FE1;&#x606F;&#xFF0C;&#x6B63;&#x6240;&#x8C13;&#x7532;&#x4E4B;&#x871C;&#x7CD6;&#x4E59;&#x4E4B;&#x7812;&#x971C;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x7ECF;&#x5178;&#x53EF;&#x9006;&#x8BA1;&#x7B97;&#x4E5F;&#x65E0;&#x6CD5;&#x907F;&#x514D;&#x8BEF;&#x5DEE;&#x7D2F;&#x79EF;&#x7684;&#x95EE;&#x9898;&#x3002;&#x8981;&#x6D88;&#x9664;&#x8BEF;&#x5DEE;&#x7684;&#x7D2F;&#x79EF;&#xFF0C;&#x5FC5;&#x987B;&#x8017;&#x6563;&#x6389;&#x5173;&#x4E8E;&#x8BEF;&#x5DEE;&#x7684;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x4E0D;&#x8981;&#x6025;&#xFF0C;<strong>&#x7ECF;&#x5178;&#x7EA0;&#x9519;</strong>&#x5DF2;&#x7ECF;&#x6709;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x4E86;&#x3002;&#x6BD4;&#x5982;&#x5C06;1bit&#x590D;&#x5236;&#x4E3A;3bit&#x91CD;&#x590D;&#x7684;&#x503C;$(0)\rightarrow(000)$&#xFF0C;&#x8FD9;&#x6837;&#x5373;&#x4F7F;&#x6709;&#x4E00;&#x4F4D;&#x51FA;&#x9519;&#x53D8;&#x4E3A;$(100)$&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6295;&#x7968;&#x673A;&#x5236;&#xFF08;majority voting scheme&#xFF0C;&#x5C11;&#x6570;&#x670D;&#x4ECE;&#x591A;&#x6570;&#xFF09;&#x6765;&#x7EA0;&#x9519;&#x3002;&#x5F53;&#x7136;&#x8FD9;&#x4E5F;&#x53EA;&#x80FD;&#x4EE5;&#x4E00;&#x5B9A;&#x6982;&#x7387;&#x4FDD;&#x8BC1;&#x4E0D;&#x51FA;&#x9519;&#x3002;&#x5047;&#x8BBE;&#x6BCF;&#x4E00;&#x4E2A;bit&#x51FA;&#x9519;&#x7684;&#x6982;&#x7387;&#x4E3A;$p$&#xFF0C;&#x5219;&#x4E24;&#x4E2A;bit&#x51FA;&#x9519;&#xFF08;&#x7FFB;&#x8F6C;&#xFF09;&#x7684;&#x60C5;&#x51B5;&#x6709;&#x4E09;&#x79CD;&#xFF0C;&#x6982;&#x7387;&#x4E3A;$3p^2(1-p)$&#xFF0C;&#x4E09;&#x4E2A;&#x540C;&#x65F6;&#x51FA;&#x9519;&#x7684;&#x6982;&#x7387;&#x4E3A;$p^3$&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x6295;&#x7968;&#x673A;&#x5236;&#x5931;&#x8D25;&#x7684;&#x6982;&#x7387;&#x4E3A;$3p^2(1-p)+p^3=3p^2-2p^3$&#x3002;&#x7531;&#x4E8E;&#x4E0D;&#x4F7F;&#x7528;&#x6295;&#x7968;&#x673A;&#x5236;&#x7684;&#x8BDD;&#xFF08;&#x53EA;&#x7528;1bit&#xFF09;&#x51FA;&#x9519;&#x6982;&#x7387;&#x4E3A;$p$&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x8BA9;&#x7EA0;&#x9519;&#x65B9;&#x6848;&#x66F4;&#x597D;&#xFF0C;&#x5FC5;&#x987B;&#x6709;$3p^2-2p^3&lt;p$&#xFF0C;&#x5373;$p&lt;1/2$&#x3002;</p>
<p>&#x82E5;&#x8981;&#x66F4;&#x9AD8;&#x7684;&#x6B63;&#x786E;&#x7387;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x518D;&#x591A;&#x52A0;&#x51E0;&#x4F4D;&#x91CD;&#x590D;&#x4F4D;&#x5373;&#x53EF;&#xFF0C;&#x5373;&#x4F7F;&#x7528;N-bit&#x91CD;&#x590D;&#x4F4D;&#xFF08;&#x5C3D;&#x7BA1;&#x8FD9;&#x6837;&#x5E76;&#x4E0D;&#x662F;&#x6548;&#x7387;&#x6700;&#x9AD8;&#x7684;&#xFF09;&#x3002;&#x5047;&#x8BBE;&#x6BCF;&#x4E00;&#x4E2A;bit&#x72EC;&#x7ACB;&#x540C;&#x5206;&#x5E03;&#xFF0C;&#x5176;&#x4E0D;&#x51FA;&#x9519;&#x7684;&#x6982;&#x7387;&#x90FD;&#x662F;$P=1/2+\varepsilon$&#xFF0C;&#x7531;&#x4E2D;&#x5FC3;&#x6781;&#x9650;&#x5B9A;&#x7406;&#xFF0C;&#x5F53;&#x4F4D;&#x6570;$N\rightarrow\infty$&#x65F6;&#xFF0C;&#x8FD9;&#x4E9B;bit&#x7684;&#x5E73;&#x5747;&#x503C;&#x670D;&#x4ECE;&#x5BBD;&#x5EA6;&#x4E3A;$1/\sqrt{N}$&#x7684;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#xFF0C;&#x6B64;&#x65F6;&#x6295;&#x7968;&#x673A;&#x5236;&#x51FA;&#x9519;&#x7684;&#x6982;&#x7387;&#x4E3A;$P_{error}\sim e^{-N\varepsilon^2}$&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5BF9;&#x4EFB;&#x610F;$\varepsilon&gt;0$&#xFF0C;&#x53EA;&#x8981;&#x91CD;&#x590D;&#x4F4D;&#x8DB3;&#x591F;&#x591A;&#xFF08;&#x5197;&#x4F59;&#x5EA6;$N$&#x8DB3;&#x591F;&#x5927;&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x4EFB;&#x610F;&#x5C0F;&#x7684;&#x51FA;&#x9519;&#x7387;&#x3002;&#x5373;&#x4F7F;&#x662F;$\varepsilon&lt;0$&#x4E5F;&#x4E0D;&#x662F;&#x5927;&#x95EE;&#x9898;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x660E;&#x786E;&#x6295;&#x7968;&#x673A;&#x5236;&#x7ED9;&#x51FA;&#x7684;&#x6C38;&#x8FDC;&#x662F;&#x76F8;&#x53CD;&#x7684;&#x7B54;&#x6848;&#x5373;&#x53EF;&#x3002;&#x552F;&#x4E00;&#x6709;&#x95EE;&#x9898;&#x7684;&#x662F;$\varepsilon=0$&#x60C5;&#x51B5;&#xFF0C;&#x6B64;&#x65F6;&#x4E00;&#x4E32;$N$bit&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x5B8C;&#x5168;&#x968F;&#x673A;&#xFF0C;&#x65E0;&#x6CD5;&#x63D0;&#x4F9B;&#x6709;&#x7528;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x800C;<strong>&#x91CF;&#x5B50;&#x7EA0;&#x9519;</strong>&#x5219;&#x4F1A;&#x9762;&#x4E34;&#x8BB8;&#x591A;&#x56F0;&#x96BE;&#xFF1A;</p>
<ul>
<li><strong>Phase errors</strong>. &#x9664;&#x4E86;bit-flip errors&#xFF0C;&#x5373;qubit&#x9519;&#x8BEF;&#x7FFB;&#x8F6C;$|0\rangle\rightarrow|1\rangle,|1\rangle\rightarrow|0\rangle$&#x5916;&#xFF0C;&#x8FD8;&#x4F1A;&#x6709;phase errors&#xFF0C;&#x5373;$|0\rangle\rightarrow|0\rangle,|1\rangle\rightarrow-|1\rangle$&#x3002;&#x8FD9;&#x4E2A;&#x8BEF;&#x5DEE;&#x662F;&#x5F88;&#x81F4;&#x547D;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x5B83;&#x4F1A;&#x628A;&#x6001;$\frac{1}{\sqrt{2}}(|0\rangle+|1\rangle)$&#x53D8;&#x6210;&#x5176;&#x6B63;&#x4EA4;&#x6001;$\frac{1}{\sqrt{2}}(|0\rangle-|1\rangle)$&#x3002;</li>
<li><strong>Small errors</strong>. &#x91CF;&#x5B50;&#x4FE1;&#x606F;&#x662F;&#x8FDE;&#x7EED;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x5C0F;&#x6270;&#x52A8;&#x4F1A;&#x628A;$a|0\rangle+b|1\rangle$&#x7684;&#x7CFB;&#x6570;$a$&#x548C;$b$&#x6539;&#x53D8;&#x5C0F;&#x91CF;&#xFF0C;&#x8FD9;&#x4E9B;&#x5C0F;&#x91CF;&#x4F1A;&#x968F;&#x65F6;&#x95F4;&#x4E0D;&#x65AD;&#x7D2F;&#x79EF;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x7ECF;&#x5178;&#x7EA0;&#x9519;&#x7EA0;&#x6B63;&#x7684;&#x662F;&#x6BD4;&#x8F83;&#x5927;&#x7684;&#x8BEF;&#x5DEE;&#xFF08;&#x7FFB;&#x8F6C;&#xFF09;&#x3002;</li>
<li><strong>Measurement causes disturbance</strong>. &#x987E;&#x540D;&#x601D;&#x4E49;&#xFF0C;&#x6295;&#x7968;&#x673A;&#x5236;&#x4E2D;&#xFF0C;&#x6D4B;&#x91CF;&#x4F1A;&#x5E72;&#x6270;&#x91CF;&#x5B50;&#x4FE1;&#x606F;&#x3002;</li>
<li><p><strong>No cloning</strong>. &#x91CF;&#x5B50;&#x4FE1;&#x606F;&#x7684;&#x590D;&#x5236;&#x53D7;&#x5236;&#x4E8E;&#x4E0D;&#x53EF;&#x514B;&#x9686;&#x5B9A;&#x7406;&#xFF0C;&#x800C;&#x7ECF;&#x5178;&#x4FE1;&#x606F;&#x53EF;&#x4EE5;&#x5B8C;&#x7F8E;&#x590D;&#x5236;&#x3002;</p>
<h4 id="18-quantum-error-correcting-codes">1.8 Quantum error-correcting codes</h4>
<p>&#x91CF;&#x5B50;&#x95EE;&#x9898;&#x6709;&#x91CF;&#x5B50;&#x7684;&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x91CF;&#x5B50;&#x7EA0;&#x9519;&#x673A;&#x5236;&#xFF08;quantum error-correcting code&#xFF09;&#x662F;Peter Shor&#x63D0;&#x51FA;&#x7684;&#xFF0C;&#x5B83;&#x662F;&#x7ECF;&#x5178;3bit&#x91CD;&#x590D;&#x4F4D;&#x673A;&#x5236;&#x7684;&#x5EF6;&#x4F38;&#xFF0C;&#x4F46;&#x662F;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x5BF9;&#x4E8E;&#x91CF;&#x5B50;&#x4FE1;&#x606F;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E0D;&#x901A;&#x8FC7;&#x6D4B;&#x91CF;&#x4FE1;&#x606F;&#x672C;&#x8EAB;&#x5C31;&#x80FD;&#x7EA0;&#x9519;&#x3002;&#x8003;&#x8651;&#x5C06;1qubit&#x7F16;&#x7801;&#x6210;3qubits&#xFF1A;
<script type="math/tex; mode=display">
|0\rangle\rightarrow|\bar{0}\rangle\equiv|000\rangle\\
|1\rangle\rightarrow|\bar{1}\rangle\equiv|111\rangle
</script>
&#x6216;&#x5199;&#x6210;&#x53E0;&#x52A0;&#x6001;&#xFF1A;
<script type="math/tex; mode=display">
a|0\rangle+b|1\rangle\rightarrow a|000\rangle+b|111\rangle
</script>
&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x4E0D;&#x6539;&#x53D8;&#x6B64;&#x53E0;&#x52A0;&#x6001;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x7EA0;&#x6B63;1bit&#x7FFB;&#x8F6C;&#x8BEF;&#x5DEE;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x53EA;&#x6D4B;&#x91CF;&#x4E00;&#x4E2A;qubit&#xFF0C;&#x90A3;&#x4E48;&#x8FD8;&#x662F;&#x4F1A;&#x584C;&#x7F29;&#x5230;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x672C;&#x5F81;&#x6001;&#xFF0C;&#x4F7F;&#x5F97;&#x7CFB;&#x6570;$a,b$&#x4E2D;&#x8574;&#x542B;&#x7684;&#x91CF;&#x5B50;&#x4FE1;&#x606F;&#x4E22;&#x5931;&#x3002;&#x4F46;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x4E00;&#x6B21;&#x540C;&#x65F6;&#x5BF9;&#x4E24;&#x4E2A;qubit&#x6D4B;&#x91CF;&#xFF0C;&#x540C;&#x65F6;&#x6D4B;&#x91CF;&#x5C31;&#x8DB3;&#x591F;&#x63A2;&#x6D4B;&#x5230;&#x662F;&#x5426;&#x6709;&#x7FFB;&#x8F6C;&#x8BEF;&#x5DEE;&#x4E86;&#x3002;&#x5BF9;3qubit&#x6001;$|x,y,z\rangle=|000\rangle\text{or}|111\rangle$&#xFF0C;&#x6211;&#x4EEC;&#x6D4B;&#x91CF;$(y\oplus z,x\oplus z)$&#xFF0C;&#x5176;&#x4E2D;&#x5F02;&#x6216;&#x64CD;&#x4F5C;$\oplus$&#x4E5F;&#x53EF;&#x4EE5;&#x7B49;&#x4EF7;&#x5B9A;&#x4E49;&#x4E3A;&#x201C;&#x76F8;&#x52A0;&#x540E;&#x53D6;&#x6A21;2&#x201D;&#xFF0C;&#x6211;&#x4EEC;&#x53D1;&#x73B0;$(y\oplus z,x\oplus z)$&#x6B63;&#x597D;&#x662F;&#x88AB;&#x7FFB;&#x8F6C;&#x7684;&#x90A3;&#x4E2A;qubit&#x4F4D;&#x7F6E;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x8868;&#x793A;&#x3002;&#x4E0B;&#x9762;&#x4E3E;&#x4E24;&#x4F8B;&#x8BF4;&#x660E;&#x3002;</p>
</li>
<li><p>&#x5982;&#x679C;&#x4EC5;&#x6709;&#x7B2C;&#x4E00;&#x4F4D;&#x7FFB;&#x8F6C;&#xFF0C;&#x5F97;&#x5230;$a|000\rangle+b|111\rangle\rightarrow a|100\rangle+b|011\rangle$&#xFF0C;&#x6D4B;&#x91CF;$(y\oplus z,x\oplus z)=(0,1)$&#xFF0C;&#x7531;&#x4E8E;$(01)<em>{2&#x8FDB;&#x5236;}=(1)</em>{10&#x8FDB;&#x5236;}$&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x8981;&#x628A;&#x7B2C;1&#x4F4D;qubit&#x7FFB;&#x8F6C;&#x8FC7;&#x6765;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x5B8C;&#x6210;&#x4E86;&#x7EA0;&#x9519;&#x3002;&#x4EC5;&#x6709;&#x7B2C;&#x4E8C;&#x6216;&#x7B2C;&#x4E09;&#x4F4D;&#x7FFB;&#x8F6C;&#x540C;&#x6837;&#x9002;&#x7528;&#x3002;</p>
</li>
<li><p>&#x5982;&#x679C;&#x4E0D;&#x662F;&#x67D0;&#x4E00;&#x4F4D;&#x7FFB;&#x8F6C;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x4E2A;&#x5C0F;&#x8BEF;&#x5DEE;
<script type="math/tex; mode=display">
  |000\rangle\rightarrow|000\rangle+\varepsilon|100\rangle\\
  |111\rangle\rightarrow|111\rangle+\varepsilon|011\rangle
  </script>
&#x90A3;&#x4E48;$a|000\rangle+b|111\rangle\rightarrow \underset{&#x7B97;&#x7B26;(y\oplus z,x\oplus z)=(0,0)&#x672C;&#x5F81;&#x6001;}{(a|000\rangle+b|111\rangle)}+ \underset{&#x7B97;&#x7B26;(y\oplus z,x\oplus z)=(0,1)&#x672C;&#x5F81;&#x6001;}{(a\varepsilon|100\rangle+b\varepsilon|011\rangle)}$&#x3002;&#x6B64;&#x65F6;&#x6D4B;&#x91CF;$(y\oplus z,x\oplus z)$&#x6709;&#x5F88;&#x5927;&#x6982;&#x7387;($p=1-|\varepsilon|^2$)&#x5F97;&#x5230;&#x672C;&#x5F81;&#x503C;$(0,0)$&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x6295;&#x5F71;&#x5230;&#x6B63;&#x786E;&#x7684;&#x672C;&#x5F81;&#x6001;&#x4E0A;&#xFF0C;&#x6D88;&#x9664;&#x4E86;&#x8BEF;&#x5DEE;&#xFF1B;&#x4E5F;&#x6709;&#x5C0F;&#x6982;&#x7387;($p=|\varepsilon|^2$)&#x5F97;&#x5230;&#x672C;&#x5F81;&#x503C;$(0,1)$&#xFF0C;&#x5373;&#x4E0A;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x7684;&#x6001;&#xFF0C;&#x6B64;&#x65F6;&#x6839;&#x636E;&#x672C;&#x5F81;&#x503C;&#x53EA;&#x9700;&#x7FFB;&#x8F6C;&#x7B2C;&#x4E00;&#x4F4D;bit&#x5373;&#x53EF;&#x5B8C;&#x6210;&#x7EA0;&#x9519;&#x6062;&#x590D;&#x5230;&#x6B63;&#x786E;&#x7684;&#x6001;&#x3002;&#x5BF9;&#x4E8E;$|000\rangle\rightarrow|000\rangle+\varepsilon_1|100\rangle+\varepsilon_2|010\rangle+\varepsilon_3|001\rangle$&#x540C;&#x6837;&#x5904;&#x7406;&#xFF0C;&#x4F1A;&#x6709;&#x5C0F;&#x6982;&#x7387;$O(|\varepsilon_i|^2)$&#x6295;&#x5F71;&#x5230;&#x4E09;&#x4E2A;&#x9519;&#x8BEF;&#x6001;&#xFF08;&#x67D0;&#x4E00;&#x4F4D;&#x7FFB;&#x8F6C;&#x4E86;&#xFF09;&#x5176;&#x4E2D;&#x4E4B;&#x4E00;&#xFF0C;&#x800C;&#x4E14;&#x672C;&#x5F81;&#x503C;&#x4F1A;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x5177;&#x4F53;&#x662F;&#x54EA;&#x4E00;&#x4F4D;&#x3002;</p>
</li>
</ul>
<p>&#x81F3;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x514B;&#x670D;&#x4E86;&#x91CF;&#x5B50;&#x7EA0;&#x9519;&#x7684;&#x540E;&#x4E09;&#x4E2A;&#x56F0;&#x96BE;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4E0D;&#x7834;&#x574F;&#x53E0;&#x52A0;&#x6001;&#x7684;&#x4FE1;&#x606F;&#x800C;&#x8FDB;&#x884C;&#x6D4B;&#x91CF;(<strong>&#x7B2C;3&#x70B9;</strong>)&#xFF0C;&#x91CF;&#x5B50;&#x6D4B;&#x91CF;&#x53EF;&#x4EE5;&#x5C06;&#x201C;&#x6709;&#x5C0F;&#x8BEF;&#x5DEE;&#x7684;&#x72B6;&#x6001;&#x201D;&#x6295;&#x5F71;&#x5230;&#x6CA1;&#x6709;&#x8BEF;&#x5DEE;&#x7684;&#x6001;&#xFF0C;&#x6216;&#x8005;&#x6295;&#x5F71;&#x5230;&#x7FFB;&#x8F6C;&#x4E86;&#x4E00;&#x4E2A;qubit&#x7684;&#x5177;&#x6709;&#x8F83;&#x5927;&#x79BB;&#x6563;&#x8BEF;&#x5DEE;&#x7684;&#x6001;&#xFF08;<strong>&#x7B2C;2&#x70B9;</strong>&#xFF09;&#x3002;<strong>&#x7B2C;4&#x70B9;</strong>&#x88AB;&#x5DE7;&#x5999;&#x907F;&#x5F00;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;$a|\bar{0}\rangle+b|\bar{1}\rangle$&#x5E76;&#x4E0D;&#x662F;&#x901A;&#x8FC7;&#x514B;&#x9686;&#x5F97;&#x5230;&#x7684;&#xFF0C;&#x5B83;&#x4E0E;&#x514B;&#x9686;&#x64CD;&#x4F5C;&#x5F97;&#x5230;&#x7684;&#x4E09;&#x91CD;&#x62F7;&#x8D1D;&#x6001;$(a|0\rangle+b|1\rangle)^3$&#x4E0D;&#x662F;&#x4E00;&#x56DE;&#x4E8B;&#x3002;</p>
<p>&#x53EA;&#x6709;<strong>&#x7B2C;1&#x70B9;</strong>&#x56F0;&#x96BE;phase errors&#x8FD8;&#x5B58;&#x5728;&#x3002;&#x56E0;&#x4E3A;&#x4E00;&#x65E6;&#x67D0;&#x4E00;&#x4E2A;qubit&#x53D1;&#x751F;phase error&#xFF0C;&#x90A3;&#x4E48;$a|\bar{0}\rangle+b|\bar{1}\rangle$&#x5C31;&#x53D8;&#x6210;&#x4E86;$a|\bar{0}\rangle-b|\bar{1}\rangle$&#xFF0C;&#x91CF;&#x5B50;&#x4FE1;&#x606F;&#x5C31;&#x88AB;&#x7834;&#x574F;&#x4E86;&#xFF0C;&#x800C;&#x4E14;&#x7531;&#x4E8E;&#x7528;&#x4E86;&#x4E09;&#x4E2A;qubit&#xFF0C;phase error&#x53D1;&#x751F;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x53D8;&#x5927;&#x6210;3&#x500D;&#x4E86;&#x3002;&#x4E0D;&#x8981;&#x6015;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x901A;&#x8FC7;<strong>&#x6DFB;&#x52A0;&#x5197;&#x4F59;&#x7684;qubits</strong>&#x89E3;&#x51B3;&#x4E86;bit-flip error&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6765;<strong>&#x6DFB;&#x52A0;&#x5197;&#x4F59;&#x7684;phases</strong>&#x6765;&#x89E3;&#x51B3;phase-flip error&#xFF01;</p>
<p>&#x8DDF;&#x968F;Shor&#xFF0C;&#x6211;&#x4EEC;&#x7528;&#x5C06;&#x5355;&#x4E2A;qubit&#x7528;9-qubits&#x6765;&#x7F16;&#x7801;&#xFF1A;
<script type="math/tex; mode=display">
|0\rangle\rightarrow|\bar{0}\rangle\equiv\frac{1}{2^{3/2}}(|000\rangle+|111\rangle)(|000\rangle+|111\rangle)(|000\rangle+|111\rangle),\\
|1\rangle\rightarrow|\bar{1}\rangle\equiv\frac{1}{2^{3/2}}(|000\rangle-|111\rangle)(|000\rangle-|111\rangle)(|000\rangle-|111\rangle).
</script>
&#x5373;&#x7528;&#x6BCF;&#x7EC4;3qubits&#xFF0C;&#x4E00;&#x5171;3&#x7EC4;&#x540C;&#x6837;&#x7684;&#x91CF;&#x5B50;&#x6001;&#x6784;&#x6210;&#x7684;9qubits&#x8868;&#x793A;$|\bar{0}\rangle$&#x548C;$|\bar{1}\rangle$&#x3002;&#x7531;&#x4E8E;&#x6BCF;&#x4E00;&#x7EC4;&#x5185;&#x90E8;&#x662F;3qubit&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x524D;&#x9762;&#x63D0;&#x5230;&#x7684;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x6BCF;&#x7EC4;&#x5185;&#x90E8;&#x7684;single bit-flip&#x7EA0;&#x9519;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x5047;&#x8BBE;&#x67D0;&#x4E00;&#x7EC4;&#x53D1;&#x751F;&#x4E86;phase flip&#xFF0C;&#x6B64;&#x8BEF;&#x5DEE;&#x6539;&#x53D8;&#x4E86;&#x90A3;&#x4E00;&#x7EC4;&#x91CC;$|000\rangle$&#x548C;$|111\rangle$&#x7684;&#x76F8;&#x5BF9;&#x76F8;&#x4F4D;&#xFF1A;
<script type="math/tex; mode=display">
|000\rangle+|111\rangle\rightarrow|000\rangle-|111\rangle,\\
|000\rangle-|111\rangle\rightarrow|000\rangle+|111\rangle.
</script>
&#x4F7F;&#x5F97;&#x8FD9;&#x4E00;&#x7EC4;&#x4E0E;&#x5176;&#x4ED6;&#x4E24;&#x7EC4;&#x7684;phase&#x4E0D;&#x540C;&#x3002;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7EC4;&#x4E0E;&#x7EC4;&#x4E24;&#x4E24;&#x6BD4;&#x8F83;&#xFF08;&#x800C;&#x4E0D;&#x662F;&#x6D4B;&#x91CF;&#x4E00;&#x4E2A;&#x7EC4;&#x5185;&#x90E8;&#x7684;&#x76F8;&#x5BF9;&#x76F8;&#x4F4D;&#x4ECE;&#x800C;&#x7834;&#x574F;&#x4FE1;&#x606F;&#xFF09;&#x627E;&#x51FA;&#x53D1;&#x751F;phase flip&#x7684;&#x90A3;&#x4E00;&#x7EC4;&#x8FDB;&#x884C;&#x7EA0;&#x9519;&#x3002;&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x4E00;&#x4E2A;6qubits&#x7684;&#x53EF;&#x89C2;&#x6D4B;&#x91CF;&#xFF0C;&#x4F8B;&#x5982;&#x7528;&#x5C06;&#x6240;&#x6709;6&#x4E2A;bit&#x7FFB;&#x8F6C;&#x7684;&#x89C2;&#x6D4B;&#x91CF;&#xFF1A;
<script type="math/tex; mode=display">
\hat{A}|\phi\rangle\equiv\hat{A}[(|000\rangle+|111\rangle)(|000\rangle-|111\rangle)]=\hat{A}[(|111\rangle+|000\rangle)(|111\rangle-|000\rangle)]=-|\phi\rangle
</script>
&#x82E5;&#x4E24;&#x7EC4;&#x7684;phase&#x4E00;&#x6837;&#xFF0C;&#x5219;&#x7279;&#x5F81;&#x503C;&#x4E3A;$+1$&#xFF0C;&#x53CD;&#x4E4B;&#x5982;&#x4E0A;&#x4E3A;$-1$&#x3002;&#x56E0;&#x6B64;&#x53EA;&#x8981;&#x505A;2&#x6B21;&#x4E24;&#x4E24;&#x6BD4;&#x8F83;&#x5C31;&#x80FD;&#x627E;&#x51FA;&#x54EA;&#x4E00;&#x7EC4;phase&#x4E0E;&#x5176;&#x4ED6;&#x4E24;&#x7EC4;&#x4E0D;&#x540C;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x90A3;&#x4E2A;&#x7EC4;&#x91CC;&#x67D0;&#x4E00;&#x4E2A;qubit&#x505A;&#x5E7A;&#x6B63;&#x76F8;&#x4F4D;&#x53D8;&#x6362;&#x5373;&#x53EF;&#x5B8C;&#x6210;&#x7EA0;&#x9519;&#x3002;</p>
<p>&#x73B0;&#x5047;&#x8BBE;9qubits&#x4E2D;&#x6BCF;&#x4E00;&#x4E2A;bit&#x7684;&#x5E7A;&#x6B63;&#x53D8;&#x6362;&#x90FD;&#x53D1;&#x751F;&#x4E86;&#x8BEF;&#x5DEE;&#x3002;&#x6700;&#x4E00;&#x822C;&#x7684;single-qubit unitary transformation (aside from a physically irrelevant overall phase) &#x53EF;&#x4EE5;&#x5C55;&#x5F00;&#x5230;$O(\varepsilon)$&#xFF1A;
<script type="math/tex; mode=display">
U=1+O(\varepsilon)=1+i\varepsilon_x\begin{pmatrix} 0 & 1 \\1 &0\end{pmatrix}+i\varepsilon_y\begin{pmatrix} 0 & -i \\i &0\end{pmatrix}+i\varepsilon_z\begin{pmatrix} 1 & 0 \\0 &-1\end{pmatrix}.
</script>
&#x6700;&#x540E;&#x4E09;&#x4E2A;Pauli&#x77E9;&#x9635;&#x53EF;&#x4EE5;&#x770B;&#x6210;bit flip&#x7B97;&#x7B26;$\begin{pmatrix} 0 &amp; 1 \1 &amp;0\end{pmatrix}$&#xFF0C;phase flip&#x7B97;&#x7B26;$\begin{pmatrix} 1 &amp; 0 \0 &amp;-1\end{pmatrix}$&#xFF0C;&#x6216;&#x8FD9;&#x4E24;&#x4E2A;&#x7B97;&#x7B26;&#x7684;&#x5408;&#x6210;$\begin{pmatrix} 0 &amp; -i \i &amp;0\end{pmatrix}$&#x3002;</p>
<blockquote>
<p>&#x6211;&#x6CE8;&#xFF1A;&#x5047;&#x8BBE;$|0\rangle\equiv(1,0)$&#xFF0C;$|1\rangle\equiv(0,1)$&#xFF0C;&#x90A3;&#x4E48;bit flip&#x8868;&#x793A;&#x4E3A;$\begin{pmatrix} 0 &amp; 1 \1 &amp;0\end{pmatrix}|0\rangle=|1\rangle$&#x3002;&#x5176;&#x4F59;&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#x3002;</p>
</blockquote>
<p>&#x5982;&#x679C;&#x5236;&#x5907;&#x4E86;$a|\bar{0}\rangle+b|\bar{1}\rangle$&#x521D;&#x6001;&#xFF0C;&#x5141;&#x8BB8;&#x6BCF;&#x4E2A;bit&#x51FA;&#x73B0;&#x5E7A;&#x6B63;&#x8BEF;&#x5DEE;&#xFF0C;&#x7136;&#x540E;&#x6D4B;&#x91CF;bit-flip&#x548C;phase-flip&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x60C5;&#x51B5;&#x53C8;&#x5C06;&#x7CFB;&#x7EDF;&#x6295;&#x5F71;&#x56DE;&#x4E86;&#x521D;&#x6001;&#xFF0C;&#x4F46;&#x6709;&#x5C0F;&#x6982;&#x7387;$O(|\varepsilon|^2)$&#x67D0;&#x4E00;&#x4E2A;bit&#x51FA;&#x73B0;&#x8F83;&#x5927;&#x8BEF;&#x5DEE;&#xFF1A;bit flip&#xFF0C;&#x6216;phase flip&#xFF0C;&#x6216;&#x4E24;&#x8005;&#x540C;&#x65F6;&#x51FA;&#x73B0;&#x3002;&#x4ECE;&#x4E0A;&#x8FF0;&#x7EA0;&#x9519;&#x673A;&#x5236;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x77E5;&#x9053;&#x54EA;&#x4E2A;qubit&#x53D1;&#x751F;&#x4E86;bit flip&#xFF0C;&#x6216;&#x54EA;&#x4E00;&#x7EC4;&#x53D1;&#x751F;&#x4E86;phase error&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x5355;&#x4E2A;qubit&#x505A;&#x5E7A;&#x6B63;&#x53D8;&#x6362;&#x7EA0;&#x9519;&#x3002;</p>
<p>&#x3010;&#x6B64;&#x6BB5;&#x4E0D;&#x7406;&#x89E3;&#x3011;Error recovery will fail if, after the syndrome measurement, there are two bit flip errors in each of two clusters (which induces a phase error in the encoded data) or if phase errors occur in two different clusters (which induces a bit-flip error in the encoded data). But the probability of such a double phase error is of order $|&#x3B5;|^4$. So for $|&#x3B5;|$ small enough, coding improves the reliability of the quantum information.</p>
<p>&#x4E0A;&#x8FF0;&#x673A;&#x5236;&#x907F;&#x514D;&#x4E86;&#x91CF;&#x5B50;&#x9000;&#x76F8;&#x5E72;&#xFF0C;&#x5373;&#x907F;&#x514D;&#x4E86;&#x91CF;&#x5B50;&#x6001;&#x4E0E;&#x73AF;&#x5883;&#x53D1;&#x751F;&#x4EFB;&#x4F55;&#x7EA0;&#x7F20;&#x3002;</p>
<p>&#x91CF;&#x5B50;&#x7EA0;&#x9519;&#x4E5F;&#x662F;&#x4E2A;&#x8017;&#x6563;&#x8FC7;&#x7A0B;&#xFF0C;&#x56E0;&#x4E3A;&#x5173;&#x4E8E;&#x8BEF;&#x5DEE;&#x7684;&#x4FE1;&#x606F;&#x4ECE;&#x91CF;&#x5B50;&#x7CFB;&#x7EDF;&#x4E2D;&#x88AB;&#x62B9;&#x53BB;&#x4E86;&#x3002;&#x8BEF;&#x5DEE;&#x4FE1;&#x606F;&#x8BB0;&#x5F55;&#x5728;&#x6D4B;&#x91CF;&#x7ED3;&#x679C;&#x4E2D;&#xFF0C;&#x4E00;&#x65E6;&#x7ED3;&#x679C;&#x88AB;&#x64E6;&#x9664;&#xFF0C;&#x5C31;&#x4EE5;&#x70ED;&#x91CF;&#x5F62;&#x5F0F;&#x8017;&#x6563;&#x6389;&#x4E86;&#x3002;</p>
<p>&#x540E;&#x7EED;&#x6211;&#x4EEC;&#x5C06;&#x8FDB;&#x4E00;&#x6B65;&#x8BA8;&#x8BBA;&#x91CF;&#x5B50;&#x7EA0;&#x9519;&#x673A;&#x5236;&#x7684;&#x51E0;&#x4E2A;&#x65B9;&#x9762;&#xFF1A;</p>
<ul>
<li>&#x5982;&#x540C;&#x7ECF;&#x5178;&#x7EA0;&#x9519;&#xFF0C;&#x5B58;&#x5728;&#x6709;&#x201C;&#x597D;&#x201D;&#x7684;&#x91CF;&#x5B50;&#x7EA0;&#x9519;&#x673A;&#x5236;&#x5141;&#x8BB8;&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x4EFB;&#x610F;&#x9AD8;&#x7684;&#x53EF;&#x9760;&#x6027;&#xFF0C;&#x53EA;&#x8981;&#x6BCF;&#x4E2A;bit&#x7684;&#x9519;&#x8BEF;&#x7387;&#x8DB3;&#x591F;&#x5C0F;&#x3002;</li>
<li>&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x5047;&#x8BBE;&#xFF0C;&#x6267;&#x884C;&#x201C;&#x7EA0;&#x9519;&#x2014;&#x6062;&#x590D;&#x201D;&#x8FC7;&#x7A0B;&#x672C;&#x8EAB;&#x662F;&#x65E0;&#x7455;&#x75B5;&#x7684;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x79CD;&#x673A;&#x5236;&#x5F88;&#x590D;&#x6742;&#x2014;&#x8981;&#x6D4B;&#x91CF;2qubit&#x6216;6qubit&#x7684;collective observables&#x6765;&#x8BCA;&#x65AD;&#x8BEF;&#x5DEE;&#x2014;&#x56E0;&#x6B64;&#x4E5F;&#x53EF;&#x80FD;&#x7834;&#x574F;&#x6570;&#x636E;&#x3002;&#x7136;&#x800C;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x8BC1;&#x660E;&#xFF0C;&#x5C3D;&#x7BA1;&#x6062;&#x590D;&#x8FC7;&#x7A0B;&#x6709;&#x5076;&#x53D1;&#x7684;&#x8BEF;&#x5DEE;&#xFF0C;&#x5B83;&#x8FD8;&#x662F;&#x5F88;&#x6709;&#x6548;&#x7684;&#x3002;</li>
<li>&#x8981;&#x64CD;&#x4F5C;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x4E0D;&#x4EC5;&#x8981;&#x80FD;&#x53EF;&#x9760;&#x5B58;&#x50A8;&#x91CF;&#x5B50;&#x4FE1;&#x606F;&#xFF0C;&#x8FD8;&#x8981;&#x80FD;&#x5904;&#x7406;&#x5B83;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x5C55;&#x793A;&#x7528;&#x91CF;&#x5B50;&#x903B;&#x8F91;&#x95E8;&#x7684;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#x3002;</li>
</ul>
<p>&#x603B;&#x7ED3;&#x4E00;&#x4E0B;<strong>&#x91CF;&#x5B50;&#x7EA0;&#x9519;&#x673A;&#x5236;</strong>&#xFF1A;</p>
<ul>
<li>&#x8BEF;&#x5DEE;&#x88AB;&#x6570;&#x5B57;&#x5316;&#x3002;&#x5C3D;&#x7BA1;&#x91CF;&#x5B50;&#x4FE1;&#x606F;&#x8BEF;&#x5DEE;&#x53EF;&#x80FD;&#x662F;&#x5C0F;&#x91CF;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x662F;&#x53EF;&#x4EE5;&#x5C06;&#x6709;&#x8BEF;&#x5DEE;&#x7684;&#x91CF;&#x5B50;&#x6001;&#x6295;&#x5F71;&#x5230;&#x65E0;&#x8BEF;&#x5DEE;&#x6001;&#x6216;&#x6709;&#x79BB;&#x6563;&#x8BEF;&#x5DEE;&#x7684;&#x6001;&#x4E0A;&#xFF0C;&#x540E;&#x8005;&#x5F88;&#x5BB9;&#x6613;&#x7EA0;&#x9519;&#x3002;</li>
<li>&#x6211;&#x4EEC;&#x4E0D;&#x6D4B;&#x91CF;&#x6570;&#x636E;&#x5C31;&#x80FD;&#x6D4B;&#x91CF;&#x8BEF;&#x5DEE;&#x7684;&#x6027;&#x8D28;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x4F1A;&#x83B7;&#x53D6;&#xFF08;&#x4ECE;&#x800C;&#x5E72;&#x6270;&#xFF09;&#x91CF;&#x5B50;&#x4FE1;&#x606F;&#x3002;</li>
<li>&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x8BEF;&#x5DEE;&#x662F;&#x5C40;&#x57DF;&#x7684;&#xFF0C;&#x5C3D;&#x7BA1;&#x91CF;&#x5B50;&#x4FE1;&#x606F;&#x975E;&#x5C40;&#x57DF;&#x3002;&#x524D;&#x9762;&#x8BA8;&#x8BBA;&#x6709;&#x4E2A;&#x5F88;&#x91CD;&#x8981;&#x7684;<strong>&#x9690;&#x542B;&#x5047;&#x8BBE;&#xFF1A;&#x5728;&#x8DB3;&#x591F;&#x597D;&#x7684;&#x8FD1;&#x4F3C;&#x4E0B;&#xFF0C;&#x4E0D;&#x540C;qubit&#x7684;&#x8BEF;&#x5DEE;&#x76F8;&#x4E92;&#x4E4B;&#x95F4;&#x51E0;&#x4E4E;&#x65E0;&#x5173;&#x8054;</strong>&#xFF0C;&#x5373;&#x5047;&#x8BBE;&#x201C;&#x540C;&#x65F6;&#x9020;&#x6210;2&#x4E2A;qubits&#x4EA7;&#x751F;&#x8BEF;&#x5DEE;&#x201D;&#x7684;&#x4E8B;&#x4EF6;&#x7684;&#x53D1;&#x751F;&#x6982;&#x7387;&#x8FDC;&#x6BD4;&#x201C;&#x53EA;&#x5BFC;&#x81F4;1&#x4E2A;qubit&#x9519;&#x8BEF;&#x201D;&#x7684;&#x4E8B;&#x4EF6;&#x7684;&#x6982;&#x7387;&#x8981;&#x5C0F;&#x7684;&#x591A;&#x3002;&#x8FD9;&#x5F53;&#x7136;&#x662F;&#x5B58;&#x7591;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x8BEF;&#x5DEE;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x8054;&#x5F88;&#x5927;&#xFF08;&#x8BEF;&#x5DEE;&#x6709;&#x7EA0;&#x7F20;&#xFF09;&#xFF0C;&#x4E0A;&#x8FF0;&#x7EA0;&#x9519;&#x5C31;&#x4E0D;&#x53EF;&#x9760;&#x4E86;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x4E0A;&#x8FF0;&#x91CF;&#x5B50;&#x7EA0;&#x9519;&#x673A;&#x5236;&#x5C31;&#x662F;&#x5229;&#x7528;&#x4E86;&#x5047;&#x8BBE;&#x4E2D;&#x7684;&#x8BEF;&#x5DEE;&#x5C40;&#x57DF;&#x6027;&#x548C;&#x4FE1;&#x606F;&#x7684;&#x975E;&#x5C40;&#x57DF;&#x6027;&#xFF08;qubits&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x8054;&#xFF09;&#x7684;&#x5DEE;&#x522B;&#x3002;&#x53EA;&#x6D4B;&#x91CF;1&#x4E2A;qubit&#x662F;&#x65E0;&#x6CD5;&#x533A;&#x5206;$|\bar{0}\rangle$&#x548C;$|\bar{1}\rangle$&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;&#x540C;&#x6837;$1/2$&#x6982;&#x7387;&#x5F97;&#x5230;$|0\rangle$&#x6216;$|1\rangle$&#x3002;&#x8981;&#x63D0;&#x53D6;&#x6709;&#x7528;&#x4FE1;&#x606F;&#x5219;&#x9700;&#x8981;&#x4E00;&#x4E2A;3qubits&#x53EF;&#x89C2;&#x6D4B;&#x91CF;&#xFF08;&#x6BD4;&#x5982;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x7FFB;&#x8F6C;&#x4E00;&#x4E2A;&#x7EC4;&#x91CC;&#x7684;3qubits&#x7684;&#x53EF;&#x89C2;&#x6D4B;&#x91CF;&#xFF0C;&#x5B83;&#x5C31;&#x80FD;&#x901A;&#x8FC7;&#x672C;&#x5F81;&#x503C;&#x6765;&#x533A;&#x5206;$|000\rangle+|111\rangle$&#x548C;$|000\rangle-|111\rangle$&#xFF09;&#x3002;</li>
<li>&#x73AF;&#x5883;&#x4E5F;&#x8BB8;&#x5076;&#x5C14;&#x4F1A;&#x6270;&#x52A8;&#x5355;&#x4E2A;qubit&#xFF0C;&#x7B49;&#x6548;&#x4E8E;&#x201C;&#x6D4B;&#x91CF;&#x201D;&#x4E86;&#x5B83;&#xFF0C;&#x4F46;&#x662F;&#x5355;&#x4E2A;qubit&#x643A;&#x5E26;&#x7684;&#x4FE1;&#x606F;&#x51E0;&#x4E4E;&#x4E3A;&#x96F6;&#xFF0C;&#x56E0;&#x6B64;&#x6270;&#x52A8;&#x5355;&#x4E2A;qubit&#x4E0D;&#x4F1A;&#x7834;&#x574F;&#x91CF;&#x5B50;&#x4FE1;&#x606F;&#x3002;<strong>&#x91CF;&#x5B50;&#x7EA0;&#x9519;&#x673A;&#x5236;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x5C31;&#x5728;&#x4E8E;&#x975E;&#x5C40;&#x57DF;&#x7684;&#x4FE1;&#x606F;&#x4E0D;&#x53D7;&#x5C40;&#x57DF;&#x5E72;&#x6270;&#x5F71;&#x54CD;&#x8FD9;&#x4E2A;&#x4E8B;&#x5B9E;&#x3002;</strong></li>
</ul>
<h4 id="19-quantum-hardware">1.9 Quantum hardware</h4>
<p>&#x80FD;&#x64CD;&#x4F5C;qubit&#x7684;&#x786C;&#x4EF6;&#x8981;&#x6C42;&#xFF1A;</p>
<ul>
<li>Storage&#xFF1A;&#x80FD;&#x5B58;&#x50A8;qubit&#x8DB3;&#x591F;&#x957F;&#x65F6;&#x95F4;&#xFF0C;&#x6765;&#x5B8C;&#x6210;&#x6709;&#x610F;&#x601D;&#x7684;&#x8BA1;&#x7B97;</li>
<li>Isolation&#xFF1A;&#x4E0E;&#x73AF;&#x5883;&#x6709;&#x6548;&#x9694;&#x7EDD;&#xFF0C;&#x6700;&#x5C0F;&#x5316;&#x9000;&#x76F8;&#x5E72;</li>
<li>Readout&#xFF1A;&#x9AD8;&#x6548;&#x53EF;&#x9760;&#x6D4B;&#x91CF;qubits</li>
<li>Gates&#xFF1A;&#x80FD;&#x64CD;&#x7EB5;&#x5355;&#x4E2A;qubit&#x7684;&#x72B6;&#x6001;&#x548C;qubits&#x4E4B;&#x95F4;&#x7684;&#x53D7;&#x63A7;&#x76F8;&#x4E92;&#x4F5C;&#x7528;</li>
<li>Precision&#xFF1A;&#x91CF;&#x5B50;&#x903B;&#x8F91;&#x95E8;&#x5FC5;&#x987B;&#x8981;&#x9AD8;&#x7CBE;&#x5EA6;</li>
</ul>
<p>&#x8BB2;&#x4E86;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#xFF0C;Ion Trap&#xFF0C;Cavity QED&#xFF0C;NMR&#xFF0C;&#x6B64;&#x5904;&#x4E0D;&#x518D;&#x8D58;&#x8FF0;&#x3002;</p>
<h4 id="110-summary">1.10 Summary</h4>
<ol>
<li>Quantum computers can solve hard problems. </li>
<li>Quantum errors can be corrected.</li>
<li>Quantum hardware can be constructed. </li>
</ol>
<p>&#x6B64;&#x8BFE;&#x7A0B;&#x548C;&#x672C;&#x4E66;&#x7684;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x5C06;&#x8FD9;&#x4E09;&#x70B9;&#x5C55;&#x5F00;&#x8BB2;&#x89E3;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev navigation-unique" aria-label="Previous page: Introduction">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Chapter 1","level":"1.2","depth":1,"previous":{"title":"Introduction","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["mathjax-pro"],"pluginsConfig":{"mathjax-pro":{"forceSVG":false,"version":"2.7.7"},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"Chapter 1. Introduction and Overview.md","mtime":"2020-12-26T13:47:03.435Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-12-26T15:29:47.184Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.7/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-mathjax-pro/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

