
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>1.4 Quantum complexity · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="1.5 Quantum parallelism.html" />
    
    
    <link rel="prev" href="1.3 Efficient quantum algorithms.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="Chapter 1.html">
            
                <a href="Chapter 1.html">
            
                    
                    Chapter 1. Introduction and Overview
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="1.1 Physics of information.html">
            
                <a href="1.1 Physics of information.html">
            
                    
                    1.1 Physics of information
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="1.2 Quantum information.html">
            
                <a href="1.2 Quantum information.html">
            
                    
                    1.2 Quantum information
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="1.3 Efficient quantum algorithms.html">
            
                <a href="1.3 Efficient quantum algorithms.html">
            
                    
                    1.3 Efficient quantum algorithms
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.4" data-path="1.4 Quantum complexity.html">
            
                <a href="1.4 Quantum complexity.html">
            
                    
                    1.4 Quantum complexity
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="1.5 Quantum parallelism.html">
            
                <a href="1.5 Quantum parallelism.html">
            
                    
                    1.5 Quantum parallelism
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.6" data-path="1.6 A new classification of complexity.html">
            
                <a href="1.6 A new classification of complexity.html">
            
                    
                    1.6 A new classification of complexity
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.7" data-path="1.7 What about errors.html">
            
                <a href="1.7 What about errors.html">
            
                    
                    1.7 What about errors?
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.8" data-path="1.8 Quantum error-correcting codes.html">
            
                <a href="1.8 Quantum error-correcting codes.html">
            
                    
                    1.8 Quantum error-correcting codes
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.9" data-path="../1.9 Quantum hardware.md">
            
                <span>
            
                    
                    1.9 Quantum hardware
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >1.4 Quantum complexity</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="14-quantum-complexity">1.4 Quantum complexity</h2>
<p>&#x5728;Shor&#x4E4B;&#x524D;&#xFF0C;&#x5DF2;&#x7ECF;&#x6709;&#x4EBA;&#x5BF9;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x8DC3;&#x8DC3;&#x6B32;&#x8BD5;&#x3002;&#x201C;&#x91CF;&#x5B50;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x6267;&#x884C;&#x8BA1;&#x7B97;&#x201D;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x5206;&#x522B;&#x7531;Paul Benioff&#x548C;Richard Feynman&#x5728;1982&#x5E74;&#x72EC;&#x7ACB;&#x63D0;&#x51FA;&#x3002;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x968F;&#x7740;&#x5FAE;&#x578B;&#x7535;&#x8DEF;&#x7684;&#x5C0F;&#x578B;&#x5316;&#x800C;&#x81EA;&#x7136;&#x4EA7;&#x751F;&#xFF0C;&#x56E0;&#x4E3A;&#x5230;&#x5F88;&#x5C0F;&#x5C3A;&#x5EA6;&#xFF0C;&#x91CF;&#x5B50;&#x6548;&#x5E94;&#x5FC5;&#x7136;&#x663E;&#x8457;&#xFF0C;Benioff&#x5C31;&#x57FA;&#x4E8E;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x3002;&#x4F46;&#x662F;Feynman&#x7684;&#x51FA;&#x53D1;&#x70B9;&#x5F88;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x8981;&#x4E86;&#x89E3;Feynman&#x7684;&#x6D1E;&#x89C1;&#xFF0C;&#x5148;&#x5F97;&#x8BF4;&#x8BF4;&#x91CF;&#x5B50;&#x4FE1;&#x606F;&#x548C;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x7684;&#x6570;&#x5B66;&#x63CF;&#x8FF0;&#x3002;</p>
<p>&#x4F20;&#x7EDF;&#x6BD4;&#x7279;(bit)&#x6700;&#x5C0F;&#x7684;&#x4E0D;&#x53EF;&#x5206;&#x5355;&#x5143;&#x7528;0&#x548C;1&#x4E24;&#x79CD;&#x72B6;&#x6001;&#x8868;&#x793A;&#xFF0C;&#x800C;&#x91CF;&#x5B50;&#x6BD4;&#x7279;(qubit)&#x7528;&#x5F52;&#x4E00;&#x6B63;&#x4EA4;&#x57FA;<script type="math/tex; ">|0\rangle</script> &#x548C;<script type="math/tex; ">|1\rangle</script>&#x4E24;&#x4E2A;&#x6001;&#x5F20;&#x6210;&#x7684;&#x4E8C;&#x7EF4;&#x590D;&#x7A7A;&#x95F4;&#x8868;&#x793A;&#x3002;&#x4E00;&#x4E2A;&#x5F52;&#x4E00;&#x5316;&#x7684;&#x91CF;&#x5B50;&#x6BD4;&#x7279;&#x8868;&#x793A;&#x4E3A;<script type="math/tex; ">|\psi\rangle=a|0\rangle	+b|1\rangle</script>&#xFF0C;&#x5176;&#x4E2D;<script type="math/tex; ">|a|^2+|b|^2=1</script>&#xFF0C;&#x4E14;<script type="math/tex; ">a,b\in\mathbf{C}</script>&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6D4B;&#x91CF;<script type="math/tex; ">|\psi\rangle</script>&#x5230;&#x4E24;&#x4E2A;&#x57FA;&#x7684;&#x6295;&#x5F71;&#x5927;&#x5C0F;&#x3002;&#x6D4B;&#x91CF;&#x7ED3;&#x679C;&#x662F;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#xFF1A;&#x6D4B;&#x91CF;&#x7ED3;&#x679C;&#x662F;<script type="math/tex; ">|0\rangle</script>&#x6001;&#x7684;&#x6982;&#x7387;&#x662F;<script type="math/tex; ">|a|^2</script>&#xFF0C;<script type="math/tex; ">|1\rangle</script>&#x6001;&#x7684;&#x6982;&#x7387;&#x662F;<script type="math/tex; ">|b|^2</script>&#x3002;</p>
<p>N&#x4E2A;qubits&#x6784;&#x6210;&#x7684;&#x91CF;&#x5B50;&#x6001;&#x53EF;&#x4EE5;&#x7528;<script type="math/tex; ">2^N</script>&#x7EF4;&#x5E0C;&#x5C14;&#x4F2F;&#x7279;&#x7A7A;&#x95F4;&#x7684;&#x5411;&#x91CF;&#x8868;&#x793A;&#xFF0C;&#x6BD4;&#x5982;<script type="math/tex; ">|01110010 · · ·1001\rangle</script>&#x3002;&#x5982;&#x679C;&#x6BCF;&#x4E00;&#x4E2A;<script type="math/tex; ">2^N</script>&#x7EF4;&#x6B63;&#x4EA4;&#x5F52;&#x4E00;&#x57FA;&#x88AB;&#x7F16;&#x53F7;&#x4E3A;<script type="math/tex; ">|x\rangle</script>&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x8FD9;&#x4E2A;&#x7A7A;&#x95F4;&#x91CC;&#x7684;&#x4E00;&#x822C;&#x72B6;&#x6001;<script type="math/tex; ">\sum_{x=0}^{2^N-1}a_x|x\rangle</script>&#xFF0C;&#x5176;&#x4E2D;<script type="math/tex; ">\sum_x|a_x|^2=1</script>&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5728;&#x6BCF;&#x4E00;&#x4E2A;qubit&#x4F4D;&#x4E0A;&#x90FD;&#x7528;&#x6295;&#x5F71;&#x5230;<script type="math/tex; ">\{|0\rangle,|1\rangle\}</script>&#x6B63;&#x4EA4;&#x57FA;&#x7684;&#x6D4B;&#x91CF;&#x65B9;&#x6CD5;&#x6765;&#x6D4B;&#x91CF;N&#x4E2A;qubits&#xFF0C;&#x90A3;&#x4E48;&#x5F97;&#x5230;<script type="math/tex; ">|x\rangle</script>&#x6001;&#x7684;&#x6982;&#x7387;&#x4E3A;<script type="math/tex; ">|a_x|^2</script>&#x3002;</p>
<p>&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x8BA8;&#x8BBA;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x5236;&#x5907;&#x5177;&#x6709;N&#x4E2A;qubits&#x7684;&#x6807;&#x51C6;&#x521D;&#x6001;<script type="math/tex; ">|0\rangle|0\rangle · · · |0\rangle</script>&#xFF0C;&#x6216;&#x8868;&#x793A;&#x6210;<script type="math/tex; ">|x=0\rangle</script>&#x3002;&#x7136;&#x540E;&#x5BF9;&#x8FD9;&#x4E2A;&#x521D;&#x6001;&#x505A;&#x5E7A;&#x6B63;&#x53D8;&#x6362;<script type="math/tex; ">U</script>&#xFF08;<script type="math/tex; ">U</script>&#x53EF;&#x5206;&#x89E3;&#x6210;&#x6807;&#x51C6;&#x5316;&#x91CF;&#x5B50;&#x903B;&#x8F91;&#x95E8;&#x7684;&#x4E58;&#x79EF;&#xFF0C;&#x6BCF;&#x4E2A;&#x6807;&#x51C6;&#x91CF;&#x5B50;&#x95E8;&#x6BCF;&#x6B21;&#x53EA;&#x5BF9;&#x51E0;&#x4E2A;qubits&#x505A;&#x5E7A;&#x6B63;&#x53D8;&#x6362;&#xFF09;&#x3002;&#x5E7A;&#x6B63;&#x53D8;&#x6362;<script type="math/tex; ">U</script>&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x6D4B;&#x91CF;&#x6240;&#x6709;qubits&#x5728;&#x57FA;&#x5411;&#x91CF;<script type="math/tex; ">\{|0\rangle,|1\rangle\}</script>&#x4E0A;&#x7684;&#x6295;&#x5F71;&#xFF0C;&#x8FD9;&#x4E2A;&#x6D4B;&#x91CF;&#x503C;&#x5C31;&#x662F;&#x8BA1;&#x7B97;&#x7684;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#xFF0C;&#x6240;&#x4EE5;&#x6700;&#x7EC8;&#x7684;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x662F;&#x53EF;&#x4EE5;&#x6253;&#x5370;&#x5728;&#x7EB8;&#x4E0A;&#x7684;&#x7ECF;&#x5178;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6CE8;&#x610F;&#x5230;&#xFF0C;<strong>&#x91CF;&#x5B50;&#x7B97;&#x6CD5;&#x662F;&#x4E00;&#x79CD;&#x6982;&#x7387;&#x7B97;&#x6CD5;</strong>(probabilistic algorithm)&#xFF0C;&#x5373;&#x7531;&#x4E8E;&#x91CF;&#x5B50;&#x6D4B;&#x91CF;&#x8FC7;&#x7A0B;&#x7684;&#x968F;&#x673A;&#x6027;&#xFF0C;&#x540C;&#x6837;&#x7684;&#x7A0B;&#x5E8F;&#x53EF;&#x80FD;&#x5F97;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x6700;&#x7EC8;&#x5F97;&#x5230;&#x7684;&#x662F;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x8F93;&#x51FA;&#x7684;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x51FD;&#x6570;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;Shor&#x7684;&#x56E0;&#x6570;&#x5206;&#x89E3;&#x7B97;&#x6CD5;&#x4E5F;&#x53EA;&#x80FD;&#x4FDD;&#x8BC1;&#x5927;&#x6982;&#x7387;&#x80FD;&#x5F97;&#x5230;&#x6B63;&#x786E;&#x7684;&#x8D28;&#x56E0;&#x6570;&#xFF1B;&#x5F53;&#x7136;&#x8FD9;&#x4E5F;&#x53EF;&#x63A5;&#x53D7;&#xFF0C;&#x56E0;&#x4E3A;&#x5F88;&#x5BB9;&#x6613;&#x9A8C;&#x8BC1;&#x7ED3;&#x679C;&#x662F;&#x5426;&#x6B63;&#x786E;&#x3002;</p>
<p>&#x9700;&#x8981;&#x8BF4;&#x660E;&#x7684;&#x662F;&#xFF0C;<strong>&#x5C3D;&#x7BA1;&#x7269;&#x7406;&#x539F;&#x7406;&#x4E0D;&#x540C;&#xFF0C;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x53EF;&#x4EE5;&#x8BA1;&#x7B97;&#x7684;&#xFF0C;&#x7ECF;&#x5178;&#x8BA1;&#x7B97;&#x673A;&#x4E5F;&#x90FD;&#x80FD;&#x8BA1;&#x7B97;</strong>&#x3002;&#x7ECF;&#x5178;&#x8BA1;&#x7B97;&#x673A;&#x53EF;&#x4EE5;&#x50A8;&#x5B58;&#x548C;&#x65CB;&#x8F6C;&#x5411;&#x91CF;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x6A21;&#x62DF;&#x91CF;&#x5B50;&#x6D4B;&#x91CF;&#x8FC7;&#x7A0B;&#xFF08;&#x6295;&#x5F71;&#x5230;&#x6B63;&#x4EA4;&#x57FA;&#x5411;&#x91CF;&#xFF09;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x7ECF;&#x5178;&#x8BA1;&#x7B97;&#x673A;&#x80FD;&#x591F;&#x4EE5;&#x4EFB;&#x610F;&#x7CBE;&#x5EA6;&#x6A21;&#x62DF;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x3002;&#x7528;&#x54EA;&#x79CD;&#x8BA1;&#x7B97;&#x673A;&#x5176;&#x5B9E;&#x4E0D;&#x662F;&#x91CD;&#x70B9;&#xFF0C;&#x56E0;&#x4E3A;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#x662F;&#x201C;&#x53EF;&#x8BA1;&#x7B97;&#x7684;&#x201D;&#x5BF9;&#x4E24;&#x8005;&#x6765;&#x8BF4;&#x662F;&#x76F8;&#x540C;&#x7684;&#x3002;</p>
<p><strong>&#x4F46;&#x7528;&#x7ECF;&#x5178;&#x8BA1;&#x7B97;&#x673A;&#x6A21;&#x62DF;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x4E5F;&#x6709;&#x5C40;&#x9650;</strong>&#xFF0C;&#x9700;&#x8981;&#x8003;&#x8651;&#x5230;&#x8FD9;&#x79CD;&#x6A21;&#x62DF;&#x7684;&#x65F6;&#x957F;&#x3002;&#x6BD4;&#x5982;&#x6A21;&#x62DF;<script type="math/tex; ">N=100</script>qubits&#x7684;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x8868;&#x793A;&#x4EFB;&#x610F;&#x4E00;&#x4E2A;&#x4E00;&#x822C;&#x7684;&#x72B6;&#x6001;<script type="math/tex; ">|\psi\rangle</script>&#x5C31;&#x9700;&#x8981;&#x7528;&#x5230;<script type="math/tex; ">2^{100}\approx10^{30}</script>&#x4E2A;&#x590D;&#x6570;&#xFF0C;&#x8FD9;&#x4E2A;&#x5B58;&#x50A8;&#x80FD;&#x529B;&#x5DF2;&#x7ECF;&#x8FDC;&#x8D85;&#x4EFB;&#x4F55;&#x7ECF;&#x5178;&#x8BA1;&#x7B97;&#x673A;&#x4E86;&#xFF0C;&#x800C;&#x4E14;&#x5BF9;<script type="math/tex; ">10^{30}</script>&#x7EF4;&#x5411;&#x91CF;&#x8FDB;&#x884C;&#x65CB;&#x8F6C;&#x64CD;&#x4F5C;&#x4E5F;&#x8FDC;&#x8D85;&#x4EFB;&#x4F55;&#x7ECF;&#x5178;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x3002;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x7528;<script type="math/tex; ">N=100</script>&#x7ECF;&#x5178;&#x6BD4;&#x7279;&#x8868;&#x793A;&#x7684;&#x4EFB;&#x610F;&#x4E00;&#x4E2A;&#x4E00;&#x822C;&#x72B6;&#x6001;&#xFF0C;&#x5C3D;&#x7BA1;&#x5B83;&#x540C;&#x6837;&#x53EF;&#x4EE5;&#x8868;&#x793A;<script type="math/tex; ">2^{100}</script>&#x4E2A;&#x53EF;&#x80FD;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x4F46;&#x53EA;&#x9700;&#x8981;&#x7528;&#x957F;&#x5EA6;&#x4E3A;<script type="math/tex; ">N</script>&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x5B57;&#x7B26;&#x4E32;&#x63CF;&#x8FF0;&#x5373;&#x53EF;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x7EB5;&#x4F7F;&#x7ECF;&#x5178;&#x8BA1;&#x7B97;&#x673A;&#x53EF;&#x4EE5;&#x6A21;&#x62DF;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x5F53;<script type="math/tex; ">N</script>&#x53D8;&#x5927;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7528;&#x7ECF;&#x5178;&#x6A21;&#x62DF;&#x91CF;&#x5B50;&#x4E5F;&#x4F1A;&#x65E0;&#x80FD;&#x4E3A;&#x529B;&#xFF0C;&#x56E0;&#x4E3A;&#x5E0C;&#x5C14;&#x4F2F;&#x7279;&#x7A7A;&#x95F4;&#x662F;&#x5728;&#x592A;&#x5927;&#x4E86;&#xFF01;Feynman&#x6B63;&#x662F;&#x57FA;&#x4E8E;&#x6B64;&#x624D;&#x8003;&#x8651;&#x5230;&#xFF0C;<strong>&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x6216;&#x8BB8;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x7ECF;&#x5178;&#x8BA1;&#x7B97;&#x673A;&#x4E0D;&#x53EF;&#x80FD;&#x5B8C;&#x6210;&#x7684;&#x4EFB;&#x52A1;</strong>&#xFF08;&#x5F53;&#x7136;&#xFF0C;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x4E5F;&#x53EF;&#x4EE5;&#x8F7B;&#x800C;&#x6613;&#x4E3E;&#x5730;&#x6A21;&#x62DF;&#x5B83;&#x81EA;&#x8EAB;&#xFF01;&#xFF09;&#x3002;Shor&#x7684;&#x7ED3;&#x679C;&#x4F3C;&#x4E4E;&#x5370;&#x8BC1;&#x4E86;&#x8FD9;&#x4E2A;&#x89C2;&#x70B9;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x8FD9;&#x4E2A;&#x7ECF;&#x5178;&#x8BA1;&#x7B97;&#x673A;&#x80FD;&#x529B;&#x7684;&#x56F0;&#x5883;&#x5417;&#xFF1F;&#x53CD;&#x8FC7;&#x6765;&#x601D;&#x8003;&#x4E00;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x8981;&#x6C42;&#x6A21;&#x62DF;&#x80FD;&#x7ED9;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x6982;&#x7387;&#x5206;&#x5E03;&#xFF0C;&#x4F46;&#x662F;&#x4E2D;&#x95F4;&#x8FC7;&#x7A0B;&#x4E0D;&#x5FC5;&#x5B8C;&#x6574;&#x6A21;&#x62DF;N-qubit&#x7684;&#x91CF;&#x5B50;&#x6001;&#x6F14;&#x5316;&#x8FC7;&#x7A0B;&#x3002;&#x56E0;&#x6B64;&#xFF0C;<strong>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8BBE;&#x8BA1;&#x4E00;&#x79CD;&#x7ECF;&#x5178;&#x7B97;&#x6CD5;&#x7684;&#x6982;&#x7387;&#x5316;&#x7248;&#x672C;</strong>(probabilistic classical algorithm)&#xFF1A;&#x8F93;&#x5165;&#x5E76;&#x4E0D;&#x552F;&#x4E00;&#x51B3;&#x5B9A;&#x8F93;&#x51FA;&#xFF0C;&#x800C;&#x662F;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x670D;&#x4ECE;&#x4E0E;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x76F8;&#x540C;&#x7684;&#x6982;&#x7387;&#x5206;&#x5E03;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x79CD;<strong>&#x5C40;&#x57DF;&#x7684;&#x6A21;&#x62DF;</strong>&#xFF08;local simulation&#xFF09;&#xFF1A;&#x6BCF;&#x4E00;&#x6B65;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;qubit&#x6709;&#x786E;&#x5B9A;&#x503C;&#xFF0C;&#x4F46;&#x5904;&#x7406;&#x8FD9;&#x4E2A;qubit&#x7684;&#x91CF;&#x5B50;&#x903B;&#x8F91;&#x95E8;&#x4F9D;&#x636E;&#xFF08;&#x4F2A;&#xFF09;&#x968F;&#x673A;&#x6570;&#x9009;&#x5B9A;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x64CD;&#x4F5C;&#x65B9;&#x5F0F;&#x4E4B;&#x4E00;&#x3002;&#x8FD9;&#x79CD;&#x6A21;&#x62DF;&#x65B9;&#x5F0F;&#x5927;&#x5927;&#x7B80;&#x5316;&#x4E86;&#x5B8C;&#x5168;&#x8DDF;&#x8E2A;&#x91CF;&#x5B50;&#x6001;&#x6F14;&#x5316;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x4F46;<strong>Bell&#x4E0D;&#x7B49;&#x5F0F;&#x7528;&#x6570;&#x5B66;&#x5B9A;&#x7406;&#x4E0D;&#x53EF;&#x8FA9;&#x9A73;&#x5730;&#x6307;&#x51FA;&#xFF0C;&#x7ECF;&#x5178;&#x7B97;&#x6CD5;&#x7684;&#x6982;&#x7387;&#x5316;&#x6A21;&#x62DF;&#x4E0D;&#x53EF;&#x80FD;&#x5B9E;&#x73B0;</strong>&#xFF1A;&#x4E0D;&#x5B58;&#x5728;&#x5C40;&#x57DF;&#x6982;&#x7387;&#x5316;&#xFF08;local probabilistic algorithm&#xFF09;&#x7B97;&#x6CD5;&#x53EF;&#x4EE5;&#x590D;&#x73B0;&#x91CF;&#x5B50;&#x529B;&#x5B66;&#x7684;&#x7ED3;&#x679C;&#xFF01;&#xFF08;&#x8BD1;&#x8005;&#x6CE8;&#xFF1A;&#x91CF;&#x5B50;&#x5173;&#x8054;&#x662F;&#x975E;&#x5C40;&#x57DF;&#x7684;&#xFF0C;&#x5373;&#x9690;&#x53D8;&#x91CF;&#x7406;&#x8BBA;&#x662F;&#x4E0D;&#x6B63;&#x786E;&#x7684;&#x3002;&#xFF09;&#x56E0;&#x6B64;&#xFF0C;&#x5C3D;&#x7BA1;&#x6CA1;&#x6709;&#x5DF2;&#x77E5;&#x7684;&#x8BC1;&#x660E;&#xFF0C;&#x4F46;&#x662F;&#x7528;&#x7ECF;&#x5178;&#x8BA1;&#x7B97;&#x673A;&#x6A21;&#x62DF;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x4F3C;&#x4E4E;&#x662F;&#x5F88;&#x56F0;&#x96BE;&#x7684;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x7406;&#x89E3;&#x4E3A;&#x4F55;&#x91CF;&#x5B50;&#x4FE1;&#x606F;&#x7684;&#x6570;&#x5B66;&#x63CF;&#x8FF0;&#x5982;&#x6B64;&#x590D;&#x6742;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x60F3;&#x8C61;&#x4E00;&#x4E2A;3N &#xFF08;<script type="math/tex; ">n\gg1</script>&#xFF09;&#x4E2A;qubits&#x7684;&#x91CF;&#x5B50;&#x7CFB;&#x7EDF;&#xFF0C;&#x5B83;&#x88AB;&#x5206;&#x4E3A;&#x4E09;&#x4E2A;&#x5B50;&#x7CFB;&#x7EDF;&#xFF0C;&#x6BCF;&#x4E2A;&#x5B50;&#x7CFB;&#x7EDF;&#x5404;&#x81EA;&#x6709;<script type="math/tex; ">N</script>&#x4E2A;qubits&#xFF0C;&#x5206;&#x522B;&#x53EB;&#x505A;&#x5B50;&#x7CFB;&#x7EDF;(1)&#xFF0C;(2)&#x548C;(3)&#x3002;&#x6211;&#x4EEC;&#x968F;&#x673A;&#x9009;&#x53D6;&#x4E00;&#x4E2A;3N qubits&#x7684;&#x91CF;&#x5B50;&#x6001;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x8FD9;&#x4E09;&#x4E2A;&#x5B50;&#x7CFB;&#x7EDF;&#x5206;&#x5F00;&#xFF0C;&#x628A;(1)&#x53D1;&#x9001;&#x5230;Santa Barbara&#xFF0C;&#x628A;(3)&#x53D1;&#x9001;&#x5230;San Diego&#xFF0C;&#x628A;(2)&#x7559;&#x5728;Pasadena&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x60F3;&#x901A;&#x8FC7;&#x6D4B;&#x91CF;&#x6765;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x5730;&#x627E;&#x51FA;&#x7CFB;&#x7EDF;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x4E3A;&#x4E86;&#x7B80;&#x5355;&#x8D77;&#x89C1;&#xFF0C;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x624B;&#x4E0A;&#x6709;&#x65E0;&#x6570;&#x4EFD;&#x539F;&#x7CFB;&#x7EDF;&#x7684;&#x62F7;&#x8D1D;&#xFF0C;&#x6570;&#x91CF;&#x8DB3;&#x591F;&#x591A;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6D4B;&#x91CF;&#x4EFB;&#x4F55;&#x60F3;&#x77E5;&#x9053;&#x7684;&#x53EF;&#x89C2;&#x6D4B;&#x91CF;<sup><a href="#fn_&#x6CE8;" id="reffn_&#x6CE8;">&#x6CE8;</a></sup>&#x3002;&#x9664;&#x4E86;&#x4E00;&#x9879;&#x9650;&#x5236;&#x6761;&#x6B3E;&#xFF1A;&#x6211;&#x4EEC;&#x6BCF;&#x6B21;&#x6D4B;&#x91CF;&#x53EA;&#x80FD;&#x4F5C;&#x7528;&#x4E8E;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x5B50;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E0D;&#x5141;&#x8BB8;&#x6709;&#x8DE8;&#x8D8A;&#x5B50;&#x7CFB;&#x7EDF;&#x8FB9;&#x754C;&#x7684;&#x96C6;&#x4F53;&#x6D4B;&#x91CF;&#x3002;&#x4E8E;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;3N qubit&#x5178;&#x578B;&#x7684;&#x91CF;&#x5B50;&#x7CFB;&#x7EDF;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x6D4B;&#x91CF;&#x51E0;&#x4E4E;&#x5F97;&#x4E0D;&#x5230;&#x4EFB;&#x4F55;&#x5173;&#x4E8E;&#x8BE5;&#x91CF;&#x5B50;&#x6001;&#x7684;&#x6709;&#x7528;&#x4FE1;&#x606F;&#x3002;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x7528;&#x6765;&#x533A;&#x5206;&#x4E0D;&#x540C;&#x91CF;&#x5B50;&#x6001;&#x7684;&#x4FE1;&#x606F;&#x90FD;&#x5728;&#x5B50;&#x7CFB;&#x7EDF;(1)&#x3001;(2)&#x3001;(3)&#x6D4B;&#x91CF;&#x7ED3;&#x679C;&#x7684;&#x975E;&#x5C40;&#x57DF;&#x5173;&#x8054;&#xFF08;nonlocal correlations&#xFF09;&#x4E2D;&#x3002;&#x8FD9;&#x4E9B;&#x5173;&#x8054;&#x5C31;&#x662F;Bell&#x53D1;&#x73B0;&#x7684;&#x7528;&#x7269;&#x7406;&#x6765;&#x63CF;&#x8FF0;&#x91CF;&#x5B50;&#x4FE1;&#x606F;&#x6240;&#x5FC5;&#x987B;&#x7684;&#x975E;&#x5C40;&#x57DF;&#x5173;&#x8054;&#x6027;&#x3002;</p>
<p>&#x4FE1;&#x606F;&#x91CF;&#x53EF;&#x4EE5;&#x7528;&#x71B5;&#x6765;&#x8868;&#x5F81;&#xFF1A;&#x71B5;&#x8D8A;&#x5927;&#x8868;&#x793A;&#x4FE1;&#x606F;&#x8D8A;&#x5C11;&#x3002;Don Page&#x53D1;&#x73B0;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x968F;&#x673A;&#x4ECE;3N qubits&#x4E2D;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x6001;&#xFF0C;&#x90A3;&#x4E48;&#x603B;&#x4F1A;&#x53D1;&#x73B0;&#x5B83;&#x6BCF;&#x4E2A;&#x5B50;&#x7CFB;&#x7EDF;&#x7684;&#x71B5;&#x975E;&#x5E38;&#x63A5;&#x8FD1;
<script type="math/tex; ">
S\simeq N-2^{-(N+1)},
</script>
&#x6B64;&#x5904;N&#x662F;&#x5B50;&#x7CFB;&#x7EDF;&#x71B5;&#x7684;&#x6700;&#x5927;&#x53EF;&#x80FD;&#x53D6;&#x503C;&#xFF0C;&#x5BF9;&#x5E94;&#x4E8E;&#x8BE5;&#x5B50;&#x7CFB;&#x7EDF;&#x4E0D;&#x643A;&#x5E26;&#x4EFB;&#x4F55;&#x4FE1;&#x606F;&#x3002;&#x4E8E;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;N&#x5F88;&#x5927;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x53EA;&#x5206;&#x5F00;&#x6D4B;&#x91CF;&#x6BCF;&#x4E2A;&#x5B50;&#x7CFB;&#x7EDF;&#x7684;&#x8BDD;&#xFF0C;&#x53EA;&#x80FD;&#x5F97;&#x5230;&#x6307;&#x6570;&#x7EA7;&#x5C0F;&#x91CF;&#x7684;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4E0D;&#x8003;&#x8651;San Diego&#xFF0C;Pasadena&#x548C;Santa Barbara&#x7684;&#x6D4B;&#x91CF;&#x7ED3;&#x679C;&#x4E4B;&#x95F4;&#x662F;&#x5982;&#x4F55;&#x5173;&#x8054;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x6D4B;&#x91CF;&#x53EA;&#x80FD;&#x63D0;&#x4F9B;&#x5F88;&#x5C11;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x6B64;&#x5904;&#xFF0C;&#x201C;&#x5BF9;&#x4E8E;&#x5173;&#x8054;&#x7684;&#x6D4B;&#x91CF;&#x201D;&#x8868;&#x793A;&#x96C6;&#x4F53;&#x6D4B;&#x91CF;&#xFF08;collective measurement&#xFF09;&#xFF0C;&#x5373;&#x4F7F;&#x5B83;&#x5B9E;&#x9645;&#x4E0A;&#x53EF;&#x4EE5;&#x662F;&#x7531;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#x5BF9;&#x540C;&#x4E00;&#x4EFD;&#x62F7;&#x8D1D;&#x7684;&#x4E0D;&#x540C;&#x5B50;&#x7CFB;&#x7EDF;&#x5404;&#x81EA;&#x505A;&#x6D4B;&#x91CF;&#xFF0C;&#x7136;&#x540E;&#x6253;&#x7535;&#x8BDD;&#x4E92;&#x76F8;&#x901A;&#x77E5;&#x6D4B;&#x91CF;&#x7ED3;&#x679C;&#x3002;&#x901A;&#x8FC7;&#x6D4B;&#x91CF;&#x5173;&#x8054;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x77E5;&#x9053;&#x66F4;&#x591A;&#xFF1B;&#x539F;&#x7406;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5B8C;&#x5168;&#x91CD;&#x5EFA;&#x51FA;&#x8FD9;&#x4E2A;&#x91CF;&#x5B50;&#x6001;&#x3002;</p>
<p>&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x5173;&#x4E8E;3N qubits&#x91CF;&#x5B50;&#x6001;&#x7684;&#x63CF;&#x8FF0;&#x90FD;&#x5FC5;&#x987B;&#x628A;&#x8FD9;&#x4E9B;&#x975E;&#x5C40;&#x57DF;&#x7684;&#x5173;&#x8054;&#x8868;&#x5F81;&#x51FA;&#x6765;&#xFF0C;&#x7136;&#x800C;&#x8FD9;&#x662F;&#x975E;&#x5E38;&#x590D;&#x6742;&#x7684;&#x4E00;&#x4EF6;&#x4E8B;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x4E3A;&#x4F55;&#x7528;&#x7ECF;&#x5178;&#x6A21;&#x62DF;&#x4E00;&#x4E2A;&#x5927;&#x7684;&#x91CF;&#x5B50;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x5DE8;&#x91CF;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#x7684;&#x539F;&#x56E0;&#x3002;&#x5F53;&#x7CFB;&#x7EDF;&#x7684;&#x4E0D;&#x540C;&#x90E8;&#x5206;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x8FD9;&#x79CD;&#x975E;&#x5C40;&#x57DF;&#x7684;&#x5173;&#x8054;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x79F0;&#x8FD9;&#x4E9B;&#x4E0D;&#x540C;&#x90E8;&#x5206;&#x5F7C;&#x6B64;&#x201C;&#x7EA0;&#x7F20;&#x201D;&#xFF08;entangled&#xFF09;&#xFF0C;&#x5B83;&#x8868;&#x793A;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x901A;&#x8FC7;&#x7B80;&#x5355;&#x5730;&#x628A;&#x7CFB;&#x7EDF;&#x5206;&#x5F00;&#x5355;&#x72EC;&#x7814;&#x7A76;&#x6BCF;&#x4E2A;&#x90E8;&#x5206;&#xFF0C;&#x6765;&#x83B7;&#x5F97;&#x6574;&#x4F53;&#x7684;&#x72B6;&#x6001;&#x4FE1;&#x606F;&#x3002;</p>
<blockquote id="fn_&#x6CE8;">
<sup>&#x6CE8;</sup>. &#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x5BF9;&#x81EA;&#x5DF1;&#x624B;&#x4E0A;&#x672A;&#x77E5;&#x7684;&#x91CF;&#x5B50;&#x6001;&#x8FDB;&#x884C;&#x62F7;&#x8D1D;&#xFF08;&#x91CF;&#x5B50;&#x4E0D;&#x53EF;&#x514B;&#x9686;&#x539F;&#x7406;&#xFF09;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8BA9;&#x53E6;&#x4E00;&#x4E2A;&#x4EBA;&#x5236;&#x5907;&#x597D;&#x8FD9;&#x4E9B;&#x62F7;&#x8D1D;&#xFF08;&#x4ED6;&#x662F;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x660E;&#x786E;&#x5730;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x6001;&#x662F;&#x4EC0;&#x4E48;&#xFF09;&#xFF0C;&#x53EA;&#x8981;&#x4E0D;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x8FD9;&#x4E2A;&#x6001;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;<a href="#reffn_&#x6CE8;" title="Jump back to footnote [&#x6CE8;] in the text."> &#x21A9;</a>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="1.3 Efficient quantum algorithms.html" class="navigation navigation-prev " aria-label="Previous page: 1.3 Efficient quantum algorithms">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="1.5 Quantum parallelism.html" class="navigation navigation-next " aria-label="Next page: 1.5 Quantum parallelism">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"1.4 Quantum complexity","level":"1.2.4","depth":2,"next":{"title":"1.5 Quantum parallelism","level":"1.2.5","depth":2,"path":"Chapter 1/1.5 Quantum parallelism.md","ref":"Chapter 1/1.5 Quantum parallelism.md","articles":[]},"previous":{"title":"1.3 Efficient quantum algorithms","level":"1.2.3","depth":2,"path":"Chapter 1/1.3 Efficient quantum algorithms.md","ref":"Chapter 1/1.3 Efficient quantum algorithms.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["mathjax-pro","chapter-fold"],"pluginsConfig":{"mathjax-pro":{"forceSVG":false,"version":"2.7.7"},"chapter-fold":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"Chapter 1/1.4 Quantum complexity.md","mtime":"2020-12-29T09:13:44.355Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-12-29T15:01:42.836Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.7/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-mathjax-pro/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-chapter-fold/chapter-fold.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

